Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x5b1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xd879e): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x6e35b): ../Core/Src/TraceRecorder/streamports/RingBuffer/trcStreamPort.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x480ef): D:/Embedded-C/RTOS course/RTOS_Workspace/Line_follower_obstacle_avoiding_robot/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x6ceec): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x3fc7a): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xd4318): unsigned char
 <1><44>: Abbrev Number: 3 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xa3ae2): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0xd2c2c): short unsigned int
 <1><52>: Abbrev Number: 3 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0x12b08): long int
 <1><59>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x8b17f): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x52f47): long unsigned int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x63325): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x2de87): long long unsigned int
 <1><7a>: Abbrev Number: 16 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 3 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x1206a): unsigned int
 <1><88>: Abbrev Number: 2 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x3fc7c): uint8_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 24
    <8f>   DW_AT_decl_column : 19
    <90>   DW_AT_type        : <0x31>
 <1><94>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <95>   DW_AT_type        : <0x88>
 <1><99>: Abbrev Number: 2 (DW_TAG_typedef)
    <9a>   DW_AT_name        : (indirect string, offset: 0x6656d): uint32_t
    <9e>   DW_AT_decl_file   : 3
    <9f>   DW_AT_decl_line   : 48
    <a0>   DW_AT_decl_column : 20
    <a1>   DW_AT_type        : <0x59>
 <1><a5>: Abbrev Number: 5 (DW_TAG_array_type)
    <a6>   DW_AT_type        : <0x94>
    <aa>   DW_AT_sibling     : <0xb5>
 <2><ae>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <af>   DW_AT_type        : <0x81>
    <b3>   DW_AT_upper_bound : 11
 <2><b4>: Abbrev Number: 0
 <1><b5>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b6>   DW_AT_type        : <0xa5>
 <1><ba>: Abbrev Number: 3 (DW_TAG_base_type)
    <bb>   DW_AT_byte_size   : 8
    <bc>   DW_AT_encoding    : 4	(float)
    <bd>   DW_AT_name        : (indirect string, offset: 0x4f264): long double
 <1><c1>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <c2>   DW_AT_byte_size   : 4
 <1><c3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <c4>   DW_AT_byte_size   : 4
    <c4>   DW_AT_type        : <0x88>
 <1><c8>: Abbrev Number: 2 (DW_TAG_typedef)
    <c9>   DW_AT_name        : (indirect string, offset: 0xd97aa): TraceUnsignedBaseType_t
    <cd>   DW_AT_decl_file   : 4
    <ce>   DW_AT_decl_line   : 30
    <cf>   DW_AT_decl_column : 32
    <d0>   DW_AT_type        : <0x99>
 <1><d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x61029): traceResult
    <d9>   DW_AT_decl_file   : 4
    <da>   DW_AT_decl_line   : 40
    <db>   DW_AT_decl_column : 33
    <dc>   DW_AT_type        : <0xc8>
 <1><e0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e1>   DW_AT_name        : (indirect string, offset: 0xad2f9): TraceHeaderBuffer
    <e5>   DW_AT_byte_size   : 32
    <e6>   DW_AT_decl_file   : 5
    <e7>   DW_AT_decl_line   : 129
    <e8>   DW_AT_decl_column : 16
    <e8>   DW_AT_sibling     : <0xfa>
 <2><ec>: Abbrev Number: 1 (DW_TAG_member)
    <ed>   DW_AT_name        : (indirect string, offset: 0x435c0): buffer
    <f1>   DW_AT_decl_file   : 5
    <f2>   DW_AT_decl_line   : 131
    <f3>   DW_AT_decl_column : 10
    <f4>   DW_AT_type        : <0xfa>
    <f8>   DW_AT_data_member_location: 0
 <2><f9>: Abbrev Number: 0
 <1><fa>: Abbrev Number: 5 (DW_TAG_array_type)
    <fb>   DW_AT_type        : <0x88>
    <ff>   DW_AT_sibling     : <0x10a>
 <2><103>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <104>   DW_AT_type        : <0x81>
    <108>   DW_AT_upper_bound : 31
 <2><109>: Abbrev Number: 0
 <1><10a>: Abbrev Number: 2 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0x1d5c2): TraceHeaderBuffer_t
    <10f>   DW_AT_decl_file   : 5
    <110>   DW_AT_decl_line   : 132
    <111>   DW_AT_decl_column : 3
    <112>   DW_AT_type        : <0xe0>
 <1><116>: Abbrev Number: 3 (DW_TAG_base_type)
    <117>   DW_AT_byte_size   : 1
    <118>   DW_AT_encoding    : 8	(unsigned char)
    <119>   DW_AT_name        : (indirect string, offset: 0x47064): char
 <1><11d>: Abbrev Number: 5 (DW_TAG_array_type)
    <11e>   DW_AT_type        : <0xc8>
    <122>   DW_AT_sibling     : <0x12d>
 <2><126>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <127>   DW_AT_type        : <0x81>
    <12b>   DW_AT_upper_bound : 2
 <2><12c>: Abbrev Number: 0
 <1><12d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <12e>   DW_AT_name        : (indirect string, offset: 0xdefba): TraceEventBuffer
    <132>   DW_AT_byte_size   : 44
    <133>   DW_AT_decl_file   : 6
    <134>   DW_AT_decl_line   : 47
    <135>   DW_AT_decl_column : 16
    <135>   DW_AT_sibling     : <0x1c9>
 <2><139>: Abbrev Number: 1 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0xda6bb): uiHead
    <13e>   DW_AT_decl_file   : 6
    <13f>   DW_AT_decl_line   : 49
    <140>   DW_AT_decl_column : 11
    <141>   DW_AT_type        : <0x99>
    <145>   DW_AT_data_member_location: 0
 <2><146>: Abbrev Number: 1 (DW_TAG_member)
    <147>   DW_AT_name        : (indirect string, offset: 0x9124f): uiTail
    <14b>   DW_AT_decl_file   : 6
    <14c>   DW_AT_decl_line   : 50
    <14d>   DW_AT_decl_column : 11
    <14e>   DW_AT_type        : <0x99>
    <152>   DW_AT_data_member_location: 4
 <2><153>: Abbrev Number: 1 (DW_TAG_member)
    <154>   DW_AT_name        : (indirect string, offset: 0xde6c6): uiSize
    <158>   DW_AT_decl_file   : 6
    <159>   DW_AT_decl_line   : 51
    <15a>   DW_AT_decl_column : 11
    <15b>   DW_AT_type        : <0x99>
    <15f>   DW_AT_data_member_location: 8
 <2><160>: Abbrev Number: 1 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0xbaa64): uiOptions
    <165>   DW_AT_decl_file   : 6
    <166>   DW_AT_decl_line   : 52
    <167>   DW_AT_decl_column : 11
    <168>   DW_AT_type        : <0x99>
    <16c>   DW_AT_data_member_location: 12
 <2><16d>: Abbrev Number: 1 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x8cb63): uiDroppedEvents
    <172>   DW_AT_decl_file   : 6
    <173>   DW_AT_decl_line   : 53
    <174>   DW_AT_decl_column : 11
    <175>   DW_AT_type        : <0x99>
    <179>   DW_AT_data_member_location: 16
 <2><17a>: Abbrev Number: 1 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x59477): uiFree
    <17f>   DW_AT_decl_file   : 6
    <180>   DW_AT_decl_line   : 54
    <181>   DW_AT_decl_column : 11
    <182>   DW_AT_type        : <0x99>
    <186>   DW_AT_data_member_location: 20
 <2><187>: Abbrev Number: 1 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xabf20): uiSlack
    <18c>   DW_AT_decl_file   : 6
    <18d>   DW_AT_decl_line   : 55
    <18e>   DW_AT_decl_column : 11
    <18f>   DW_AT_type        : <0x99>
    <193>   DW_AT_data_member_location: 24
 <2><194>: Abbrev Number: 1 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x18bbb): uiNextHead
    <199>   DW_AT_decl_file   : 6
    <19a>   DW_AT_decl_line   : 56
    <19b>   DW_AT_decl_column : 11
    <19c>   DW_AT_type        : <0x99>
    <1a0>   DW_AT_data_member_location: 28
 <2><1a1>: Abbrev Number: 1 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xafd7c): uiTimerWraparounds
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 57
    <1a8>   DW_AT_decl_column : 11
    <1a9>   DW_AT_type        : <0x99>
    <1ad>   DW_AT_data_member_location: 32
 <2><1ae>: Abbrev Number: 1 (DW_TAG_member)
    <1af>   DW_AT_name        : (indirect string, offset: 0x26c72): uiReserved
    <1b3>   DW_AT_decl_file   : 6
    <1b4>   DW_AT_decl_line   : 58
    <1b5>   DW_AT_decl_column : 11
    <1b6>   DW_AT_type        : <0x99>
    <1ba>   DW_AT_data_member_location: 36
 <2><1bb>: Abbrev Number: 1 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x911b1): puiBuffer
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 59
    <1c2>   DW_AT_decl_column : 11
    <1c3>   DW_AT_type        : <0xc3>
    <1c7>   DW_AT_data_member_location: 40
 <2><1c8>: Abbrev Number: 0
 <1><1c9>: Abbrev Number: 2 (DW_TAG_typedef)
    <1ca>   DW_AT_name        : (indirect string, offset: 0xe2a6): TraceEventBuffer_t
    <1ce>   DW_AT_decl_file   : 6
    <1cf>   DW_AT_decl_line   : 60
    <1d0>   DW_AT_decl_column : 3
    <1d1>   DW_AT_type        : <0x12d>
 <1><1d5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d6>   DW_AT_name        : (indirect string, offset: 0xe1039): TraceMultiCoreEventBuffer
    <1da>   DW_AT_byte_size   : 4
    <1db>   DW_AT_decl_file   : 7
    <1dc>   DW_AT_decl_line   : 35
    <1dd>   DW_AT_decl_column : 16
    <1dd>   DW_AT_sibling     : <0x1ef>
 <2><1e1>: Abbrev Number: 1 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x64de3): xEventBuffer
    <1e6>   DW_AT_decl_file   : 7
    <1e7>   DW_AT_decl_line   : 37
    <1e8>   DW_AT_decl_column : 22
    <1e9>   DW_AT_type        : <0x1ef>
    <1ed>   DW_AT_data_member_location: 0
 <2><1ee>: Abbrev Number: 0
 <1><1ef>: Abbrev Number: 5 (DW_TAG_array_type)
    <1f0>   DW_AT_type        : <0x1ff>
    <1f4>   DW_AT_sibling     : <0x1ff>
 <2><1f8>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1f9>   DW_AT_type        : <0x81>
    <1fd>   DW_AT_upper_bound : 0
 <2><1fe>: Abbrev Number: 0
 <1><1ff>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <200>   DW_AT_byte_size   : 4
    <200>   DW_AT_type        : <0x1c9>
 <1><204>: Abbrev Number: 2 (DW_TAG_typedef)
    <205>   DW_AT_name        : (indirect string, offset: 0x225d5): TraceMultiCoreEventBuffer_t
    <209>   DW_AT_decl_file   : 7
    <20a>   DW_AT_decl_line   : 38
    <20b>   DW_AT_decl_column : 3
    <20c>   DW_AT_type        : <0x1d5>
 <1><210>: Abbrev Number: 10 (DW_TAG_const_type)
    <211>   DW_AT_type        : <0x204>
 <1><215>: Abbrev Number: 8 (DW_TAG_structure_type)
    <216>   DW_AT_name        : (indirect string, offset: 0x6b771): TraceTimestampData
    <21a>   DW_AT_byte_size   : 28
    <21b>   DW_AT_decl_file   : 8
    <21c>   DW_AT_decl_line   : 35
    <21d>   DW_AT_decl_column : 16
    <21d>   DW_AT_sibling     : <0x27d>
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x8d4b7): type
    <226>   DW_AT_decl_file   : 8
    <227>   DW_AT_decl_line   : 37
    <228>   DW_AT_decl_column : 11
    <229>   DW_AT_type        : <0x99>
    <22d>   DW_AT_data_member_location: 0
 <2><22e>: Abbrev Number: 1 (DW_TAG_member)
    <22f>   DW_AT_name        : (indirect string, offset: 0xb72dc): period
    <233>   DW_AT_decl_file   : 8
    <234>   DW_AT_decl_line   : 38
    <235>   DW_AT_decl_column : 11
    <236>   DW_AT_type        : <0x99>
    <23a>   DW_AT_data_member_location: 4
 <2><23b>: Abbrev Number: 1 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x13983): frequency
    <240>   DW_AT_decl_file   : 8
    <241>   DW_AT_decl_line   : 39
    <242>   DW_AT_decl_column : 26
    <243>   DW_AT_type        : <0xc8>
    <247>   DW_AT_data_member_location: 8
 <2><248>: Abbrev Number: 1 (DW_TAG_member)
    <249>   DW_AT_name        : (indirect string, offset: 0xa4321): wraparounds
    <24d>   DW_AT_decl_file   : 8
    <24e>   DW_AT_decl_line   : 40
    <24f>   DW_AT_decl_column : 11
    <250>   DW_AT_type        : <0x99>
    <254>   DW_AT_data_member_location: 12
 <2><255>: Abbrev Number: 1 (DW_TAG_member)
    <256>   DW_AT_name        : (indirect string, offset: 0x1d363): osTickHz
    <25a>   DW_AT_decl_file   : 8
    <25b>   DW_AT_decl_line   : 41
    <25c>   DW_AT_decl_column : 11
    <25d>   DW_AT_type        : <0x99>
    <261>   DW_AT_data_member_location: 16
 <2><262>: Abbrev Number: 1 (DW_TAG_member)
    <263>   DW_AT_name        : (indirect string, offset: 0x4d7e2): latestTimestamp
    <267>   DW_AT_decl_file   : 8
    <268>   DW_AT_decl_line   : 42
    <269>   DW_AT_decl_column : 11
    <26a>   DW_AT_type        : <0x99>
    <26e>   DW_AT_data_member_location: 20
 <2><26f>: Abbrev Number: 1 (DW_TAG_member)
    <270>   DW_AT_name        : (indirect string, offset: 0x96fae): osTickCount
    <274>   DW_AT_decl_file   : 8
    <275>   DW_AT_decl_line   : 43
    <276>   DW_AT_decl_column : 11
    <277>   DW_AT_type        : <0x99>
    <27b>   DW_AT_data_member_location: 24
 <2><27c>: Abbrev Number: 0
 <1><27d>: Abbrev Number: 2 (DW_TAG_typedef)
    <27e>   DW_AT_name        : (indirect string, offset: 0x1f8db): TraceTimestampData_t
    <282>   DW_AT_decl_file   : 8
    <283>   DW_AT_decl_line   : 44
    <284>   DW_AT_decl_column : 3
    <285>   DW_AT_type        : <0x215>
 <1><289>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <28a>   DW_AT_byte_size   : 4
    <28a>   DW_AT_type        : <0x27d>
 <1><28e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <28f>   DW_AT_name        : (indirect string, offset: 0x7cf88): TraceEntry
    <293>   DW_AT_byte_size   : 48
    <294>   DW_AT_decl_file   : 9
    <295>   DW_AT_decl_line   : 67
    <296>   DW_AT_decl_column : 16
    <296>   DW_AT_sibling     : <0x2cf>
 <2><29a>: Abbrev Number: 1 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0xaca7f): pvAddress
    <29f>   DW_AT_decl_file   : 9
    <2a0>   DW_AT_decl_line   : 69
    <2a1>   DW_AT_decl_column : 8
    <2a2>   DW_AT_type        : <0xc1>
    <2a6>   DW_AT_data_member_location: 0
 <2><2a7>: Abbrev Number: 1 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0xe114b): xStates
    <2ac>   DW_AT_decl_file   : 9
    <2ad>   DW_AT_decl_line   : 70
    <2ae>   DW_AT_decl_column : 26
    <2af>   DW_AT_type        : <0x11d>
    <2b3>   DW_AT_data_member_location: 4
 <2><2b4>: Abbrev Number: 1 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0xbaa64): uiOptions
    <2b9>   DW_AT_decl_file   : 9
    <2ba>   DW_AT_decl_line   : 71
    <2bb>   DW_AT_decl_column : 11
    <2bc>   DW_AT_type        : <0x99>
    <2c0>   DW_AT_data_member_location: 16
 <2><2c1>: Abbrev Number: 1 (DW_TAG_member)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x48baf): szSymbol
    <2c6>   DW_AT_decl_file   : 9
    <2c7>   DW_AT_decl_line   : 72
    <2c8>   DW_AT_decl_column : 7
    <2c9>   DW_AT_type        : <0x2cf>
    <2cd>   DW_AT_data_member_location: 20
 <2><2ce>: Abbrev Number: 0
 <1><2cf>: Abbrev Number: 5 (DW_TAG_array_type)
    <2d0>   DW_AT_type        : <0x116>
    <2d4>   DW_AT_sibling     : <0x2df>
 <2><2d8>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <2d9>   DW_AT_type        : <0x81>
    <2dd>   DW_AT_upper_bound : 27
 <2><2de>: Abbrev Number: 0
 <1><2df>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e0>   DW_AT_name        : (indirect string, offset: 0xd1c77): TraceEntry_t
    <2e4>   DW_AT_decl_file   : 9
    <2e5>   DW_AT_decl_line   : 73
    <2e6>   DW_AT_decl_column : 3
    <2e7>   DW_AT_type        : <0x28e>
 <1><2eb>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x760b2): TraceEntryTable
    <2f0>   DW_AT_byte_size   : 2700
    <2f2>   DW_AT_decl_file   : 9
    <2f3>   DW_AT_decl_line   : 75
    <2f4>   DW_AT_decl_column : 16
    <2f4>   DW_AT_sibling     : <0x32d>
 <2><2f8>: Abbrev Number: 1 (DW_TAG_member)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x5431f): uxSlots
    <2fd>   DW_AT_decl_file   : 9
    <2fe>   DW_AT_decl_line   : 77
    <2ff>   DW_AT_decl_column : 26
    <300>   DW_AT_type        : <0xc8>
    <304>   DW_AT_data_member_location: 0
 <2><305>: Abbrev Number: 1 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xa191f): uxEntrySymbolLength
    <30a>   DW_AT_decl_file   : 9
    <30b>   DW_AT_decl_line   : 78
    <30c>   DW_AT_decl_column : 26
    <30d>   DW_AT_type        : <0xc8>
    <311>   DW_AT_data_member_location: 4
 <2><312>: Abbrev Number: 1 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0xc6231): uxEntryStateCount
    <317>   DW_AT_decl_file   : 9
    <318>   DW_AT_decl_line   : 79
    <319>   DW_AT_decl_column : 26
    <31a>   DW_AT_type        : <0xc8>
    <31e>   DW_AT_data_member_location: 8
 <2><31f>: Abbrev Number: 1 (DW_TAG_member)
    <320>   DW_AT_name        : (indirect string, offset: 0x51592): axEntries
    <324>   DW_AT_decl_file   : 9
    <325>   DW_AT_decl_line   : 80
    <326>   DW_AT_decl_column : 15
    <327>   DW_AT_type        : <0x32d>
    <32b>   DW_AT_data_member_location: 12
 <2><32c>: Abbrev Number: 0
 <1><32d>: Abbrev Number: 5 (DW_TAG_array_type)
    <32e>   DW_AT_type        : <0x2df>
    <332>   DW_AT_sibling     : <0x33d>
 <2><336>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <337>   DW_AT_type        : <0x81>
    <33b>   DW_AT_upper_bound : 55
 <2><33c>: Abbrev Number: 0
 <1><33d>: Abbrev Number: 2 (DW_TAG_typedef)
    <33e>   DW_AT_name        : (indirect string, offset: 0x41eb5): TraceEntryTable_t
    <342>   DW_AT_decl_file   : 9
    <343>   DW_AT_decl_line   : 81
    <344>   DW_AT_decl_column : 3
    <345>   DW_AT_type        : <0x2eb>
 <1><349>: Abbrev Number: 9 (DW_TAG_structure_type)
    <34a>   DW_AT_name        : (indirect string, offset: 0x6fee9): TraceMultiCoreBuffer
    <34e>   DW_AT_byte_size   : 10244
    <350>   DW_AT_decl_file   : 10
    <351>   DW_AT_decl_line   : 54
    <352>   DW_AT_decl_column : 16
    <352>   DW_AT_sibling     : <0x371>
 <2><356>: Abbrev Number: 1 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x59c6d): uxSize
    <35b>   DW_AT_decl_file   : 10
    <35c>   DW_AT_decl_line   : 56
    <35d>   DW_AT_decl_column : 26
    <35e>   DW_AT_type        : <0xc8>
    <362>   DW_AT_data_member_location: 0
 <2><363>: Abbrev Number: 1 (DW_TAG_member)
    <364>   DW_AT_name        : (indirect string, offset: 0x911b2): uiBuffer
    <368>   DW_AT_decl_file   : 10
    <369>   DW_AT_decl_line   : 57
    <36a>   DW_AT_decl_column : 10
    <36b>   DW_AT_type        : <0x371>
    <36f>   DW_AT_data_member_location: 4
 <2><370>: Abbrev Number: 0
 <1><371>: Abbrev Number: 5 (DW_TAG_array_type)
    <372>   DW_AT_type        : <0x88>
    <376>   DW_AT_sibling     : <0x382>
 <2><37a>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <37b>   DW_AT_type        : <0x81>
    <37f>   DW_AT_upper_bound : 10239
 <2><381>: Abbrev Number: 0
 <1><382>: Abbrev Number: 2 (DW_TAG_typedef)
    <383>   DW_AT_name        : (indirect string, offset: 0x55484): TraceMultiCoreBuffer_t
    <387>   DW_AT_decl_file   : 10
    <388>   DW_AT_decl_line   : 58
    <389>   DW_AT_decl_column : 3
    <38a>   DW_AT_type        : <0x349>
 <1><38e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <38f>   DW_AT_name        : (indirect string, offset: 0x80f92): TraceRingBuffer
    <393>   DW_AT_byte_size   : 13036
    <395>   DW_AT_decl_file   : 10
    <396>   DW_AT_decl_line   : 63
    <397>   DW_AT_decl_column : 16
    <397>   DW_AT_sibling     : <0x404>
 <2><39b>: Abbrev Number: 1 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x9e269): reserved0
    <3a0>   DW_AT_decl_file   : 10
    <3a1>   DW_AT_decl_line   : 65
    <3a2>   DW_AT_decl_column : 11
    <3a3>   DW_AT_type        : <0x99>
    <3a7>   DW_AT_data_member_location: 0
 <2><3a8>: Abbrev Number: 1 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x1ee22): START_MARKERS
    <3ad>   DW_AT_decl_file   : 10
    <3ae>   DW_AT_decl_line   : 66
    <3af>   DW_AT_decl_column : 19
    <3b0>   DW_AT_type        : <0xb5>
    <3b4>   DW_AT_data_member_location: 4
 <2><3b5>: Abbrev Number: 1 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x68758): xHeaderBuffer
    <3ba>   DW_AT_decl_file   : 10
    <3bb>   DW_AT_decl_line   : 67
    <3bc>   DW_AT_decl_column : 22
    <3bd>   DW_AT_type        : <0x10a>
    <3c1>   DW_AT_data_member_location: 16
 <2><3c2>: Abbrev Number: 1 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0xb8b9f): xTimestampInfo
    <3c7>   DW_AT_decl_file   : 10
    <3c8>   DW_AT_decl_line   : 68
    <3c9>   DW_AT_decl_column : 23
    <3ca>   DW_AT_type        : <0x27d>
    <3ce>   DW_AT_data_member_location: 48
 <2><3cf>: Abbrev Number: 1 (DW_TAG_member)
    <3d0>   DW_AT_name        : (indirect string, offset: 0xdd615): xEntryTable
    <3d4>   DW_AT_decl_file   : 10
    <3d5>   DW_AT_decl_line   : 69
    <3d6>   DW_AT_decl_column : 20
    <3d7>   DW_AT_type        : <0x33d>
    <3db>   DW_AT_data_member_location: 76
 <2><3dc>: Abbrev Number: 12 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x64de3): xEventBuffer
    <3e1>   DW_AT_decl_file   : 10
    <3e1>   DW_AT_decl_line   : 70
    <3e2>   DW_AT_decl_column : 25
    <3e3>   DW_AT_type        : <0x382>
    <3e7>   DW_AT_data_member_location: 2776
 <2><3e9>: Abbrev Number: 12 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x47cf0): END_MARKERS
    <3ee>   DW_AT_decl_file   : 10
    <3ee>   DW_AT_decl_line   : 71
    <3ef>   DW_AT_decl_column : 19
    <3f0>   DW_AT_type        : <0xb5>
    <3f4>   DW_AT_data_member_location: 13020
 <2><3f6>: Abbrev Number: 12 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x9e273): reserved1
    <3fb>   DW_AT_decl_file   : 10
    <3fb>   DW_AT_decl_line   : 72
    <3fc>   DW_AT_decl_column : 11
    <3fd>   DW_AT_type        : <0x99>
    <401>   DW_AT_data_member_location: 13032
 <2><403>: Abbrev Number: 0
 <1><404>: Abbrev Number: 2 (DW_TAG_typedef)
    <405>   DW_AT_name        : (indirect string, offset: 0xb4f0d): TraceRingBuffer_t
    <409>   DW_AT_decl_file   : 10
    <40a>   DW_AT_decl_line   : 73
    <40b>   DW_AT_decl_column : 3
    <40c>   DW_AT_type        : <0x38e>
 <1><410>: Abbrev Number: 9 (DW_TAG_structure_type)
    <411>   DW_AT_name        : (indirect string, offset: 0xc6296): TraceStreamPortData
    <415>   DW_AT_byte_size   : 13040
    <417>   DW_AT_decl_file   : 10
    <418>   DW_AT_decl_line   : 78
    <419>   DW_AT_decl_column : 16
    <419>   DW_AT_sibling     : <0x438>
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0x9412a): xMultiCoreEventBuffer
    <422>   DW_AT_decl_file   : 10
    <423>   DW_AT_decl_line   : 80
    <424>   DW_AT_decl_column : 30
    <425>   DW_AT_type        : <0x204>
    <429>   DW_AT_data_member_location: 0
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x34e12): xRingBuffer
    <42f>   DW_AT_decl_file   : 10
    <430>   DW_AT_decl_line   : 81
    <431>   DW_AT_decl_column : 20
    <432>   DW_AT_type        : <0x404>
    <436>   DW_AT_data_member_location: 4
 <2><437>: Abbrev Number: 0
 <1><438>: Abbrev Number: 2 (DW_TAG_typedef)
    <439>   DW_AT_name        : (indirect string, offset: 0x7192b): TraceStreamPortData_t
    <43d>   DW_AT_decl_file   : 10
    <43e>   DW_AT_decl_line   : 82
    <43f>   DW_AT_decl_column : 3
    <440>   DW_AT_type        : <0x410>
 <1><444>: Abbrev Number: 18 (DW_TAG_variable)
    <445>   DW_AT_name        : (indirect string, offset: 0x3dca4): pxStreamPortData
    <449>   DW_AT_decl_file   : 10
    <44a>   DW_AT_decl_line   : 84
    <44b>   DW_AT_decl_column : 31
    <44c>   DW_AT_type        : <0x450>
    <450>   DW_AT_external    : 1
    <450>   DW_AT_declaration : 1
 <1><450>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <451>   DW_AT_byte_size   : 4
    <451>   DW_AT_type        : <0x438>
 <1><455>: Abbrev Number: 9 (DW_TAG_structure_type)
    <456>   DW_AT_name        : (indirect string, offset: 0x29903): TraceStreamPortBuffer
    <45a>   DW_AT_byte_size   : 13040
    <45c>   DW_AT_decl_file   : 10
    <45d>   DW_AT_decl_line   : 95
    <45e>   DW_AT_decl_column : 16
    <45e>   DW_AT_sibling     : <0x470>
 <2><462>: Abbrev Number: 1 (DW_TAG_member)
    <463>   DW_AT_name        : (indirect string, offset: 0x435c0): buffer
    <467>   DW_AT_decl_file   : 10
    <468>   DW_AT_decl_line   : 97
    <469>   DW_AT_decl_column : 10
    <46a>   DW_AT_type        : <0x470>
    <46e>   DW_AT_data_member_location: 0
 <2><46f>: Abbrev Number: 0
 <1><470>: Abbrev Number: 5 (DW_TAG_array_type)
    <471>   DW_AT_type        : <0x88>
    <475>   DW_AT_sibling     : <0x481>
 <2><479>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <47a>   DW_AT_type        : <0x81>
    <47e>   DW_AT_upper_bound : 13039
 <2><480>: Abbrev Number: 0
 <1><481>: Abbrev Number: 2 (DW_TAG_typedef)
    <482>   DW_AT_name        : (indirect string, offset: 0xcf06d): TraceStreamPortBuffer_t
    <486>   DW_AT_decl_file   : 10
    <487>   DW_AT_decl_line   : 98
    <488>   DW_AT_decl_column : 3
    <489>   DW_AT_type        : <0x455>
 <1><48d>: Abbrev Number: 2 (DW_TAG_typedef)
    <48e>   DW_AT_name        : (indirect string, offset: 0xde04a): RecorderData
    <492>   DW_AT_decl_file   : 1
    <493>   DW_AT_decl_line   : 20
    <494>   DW_AT_decl_column : 27
    <495>   DW_AT_type        : <0x404>
 <1><499>: Abbrev Number: 19 (DW_TAG_variable)
    <49a>   DW_AT_name        : (indirect string, offset: 0xa82eb): RecorderDataPtr
    <49e>   DW_AT_decl_file   : 1
    <49f>   DW_AT_decl_line   : 21
    <4a0>   DW_AT_decl_column : 15
    <4a1>   DW_AT_type        : <0x4ab>
    <4a5>   DW_AT_external    : 1
    <4a5>   DW_AT_location    : 5 byte block: 3 8 2 0 20 	(DW_OP_addr: 20000208)
 <1><4ab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <4ac>   DW_AT_byte_size   : 4
    <4ac>   DW_AT_type        : <0x48d>
 <1><4b0>: Abbrev Number: 20 (DW_TAG_variable)
    <4b1>   DW_AT_specification: <0x444>
    <4b5>   DW_AT_decl_file   : 1
    <4b6>   DW_AT_decl_line   : 23
    <4b7>   DW_AT_decl_column : 24
    <4b8>   DW_AT_location    : 5 byte block: 3 c 2 0 20 	(DW_OP_addr: 2000020c)
 <1><4be>: Abbrev Number: 11 (DW_TAG_subprogram)
    <4bf>   DW_AT_external    : 1
    <4bf>   DW_AT_name        : (indirect string, offset: 0x3f864): xTraceMultiCoreEventBufferClear
    <4c3>   DW_AT_decl_file   : 7
    <4c4>   DW_AT_decl_line   : 189
    <4c5>   DW_AT_decl_column : 13
    <4c5>   DW_AT_prototyped  : 1
    <4c5>   DW_AT_type        : <0xd4>
    <4c9>   DW_AT_declaration : 1
    <4c9>   DW_AT_sibling     : <0x4d3>
 <2><4cd>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <4ce>   DW_AT_type        : <0x4d8>
 <2><4d2>: Abbrev Number: 0
 <1><4d3>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <4d4>   DW_AT_byte_size   : 4
    <4d4>   DW_AT_type        : <0x210>
 <1><4d8>: Abbrev Number: 10 (DW_TAG_const_type)
    <4d9>   DW_AT_type        : <0x4d3>
 <1><4dd>: Abbrev Number: 11 (DW_TAG_subprogram)
    <4de>   DW_AT_external    : 1
    <4de>   DW_AT_name        : (indirect string, offset: 0x75dec): xTraceTimestampInitialize
    <4e2>   DW_AT_decl_file   : 8
    <4e3>   DW_AT_decl_line   : 57
    <4e4>   DW_AT_decl_column : 13
    <4e4>   DW_AT_prototyped  : 1
    <4e4>   DW_AT_type        : <0xd4>
    <4e8>   DW_AT_declaration : 1
    <4e8>   DW_AT_sibling     : <0x4f2>
 <2><4ec>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <4ed>   DW_AT_type        : <0x289>
 <2><4f1>: Abbrev Number: 0
 <1><4f2>: Abbrev Number: 11 (DW_TAG_subprogram)
    <4f3>   DW_AT_external    : 1
    <4f3>   DW_AT_name        : (indirect string, offset: 0x3b115): xTraceEntryTableInitialize
    <4f7>   DW_AT_decl_file   : 9
    <4f8>   DW_AT_decl_line   : 107
    <4f9>   DW_AT_decl_column : 13
    <4f9>   DW_AT_prototyped  : 1
    <4f9>   DW_AT_type        : <0xd4>
    <4fd>   DW_AT_declaration : 1
    <4fd>   DW_AT_sibling     : <0x507>
 <2><501>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <502>   DW_AT_type        : <0x50c>
 <2><506>: Abbrev Number: 0
 <1><507>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <508>   DW_AT_byte_size   : 4
    <508>   DW_AT_type        : <0x33d>
 <1><50c>: Abbrev Number: 10 (DW_TAG_const_type)
    <50d>   DW_AT_type        : <0x507>
 <1><511>: Abbrev Number: 21 (DW_TAG_subprogram)
    <512>   DW_AT_external    : 1
    <512>   DW_AT_name        : (indirect string, offset: 0xa3d4e): xTraceHeaderInitialize
    <516>   DW_AT_decl_file   : 5
    <517>   DW_AT_decl_line   : 1665
    <519>   DW_AT_decl_column : 13
    <51a>   DW_AT_prototyped  : 1
    <51a>   DW_AT_type        : <0xd4>
    <51e>   DW_AT_declaration : 1
    <51e>   DW_AT_sibling     : <0x528>
 <2><522>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <523>   DW_AT_type        : <0x528>
 <2><527>: Abbrev Number: 0
 <1><528>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <529>   DW_AT_byte_size   : 4
    <529>   DW_AT_type        : <0x10a>
 <1><52d>: Abbrev Number: 11 (DW_TAG_subprogram)
    <52e>   DW_AT_external    : 1
    <52e>   DW_AT_name        : (indirect string, offset: 0x5dda0): xTraceMultiCoreEventBufferInitialize
    <532>   DW_AT_decl_file   : 7
    <533>   DW_AT_decl_line   : 58
    <534>   DW_AT_decl_column : 13
    <534>   DW_AT_prototyped  : 1
    <534>   DW_AT_type        : <0xd4>
    <538>   DW_AT_declaration : 1
    <538>   DW_AT_sibling     : <0x551>
 <2><53c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <53d>   DW_AT_type        : <0x556>
 <2><541>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <542>   DW_AT_type        : <0x99>
 <2><546>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <547>   DW_AT_type        : <0xc3>
 <2><54b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <54c>   DW_AT_type        : <0x99>
 <2><550>: Abbrev Number: 0
 <1><551>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <552>   DW_AT_byte_size   : 4
    <552>   DW_AT_type        : <0x204>
 <1><556>: Abbrev Number: 10 (DW_TAG_const_type)
    <557>   DW_AT_type        : <0x551>
 <1><55b>: Abbrev Number: 22 (DW_TAG_subprogram)
    <55c>   DW_AT_external    : 1
    <55c>   DW_AT_name        : (indirect string, offset: 0xaea2c): xTraceStreamPortOnTraceBegin
    <560>   DW_AT_decl_file   : 1
    <561>   DW_AT_decl_line   : 102
    <562>   DW_AT_decl_column : 13
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_type        : <0xd4>
    <567>   DW_AT_low_pc      : 0x80011d8
    <56b>   DW_AT_high_pc     : 0x18
    <56f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <571>   DW_AT_call_all_tail_calls: 1
 <1><571>: Abbrev Number: 23 (DW_TAG_subprogram)
    <572>   DW_AT_external    : 1
    <572>   DW_AT_name        : (indirect string, offset: 0x7c8d9): xTraceStreamPortInitialize
    <576>   DW_AT_decl_file   : 1
    <577>   DW_AT_decl_line   : 25
    <578>   DW_AT_decl_column : 13
    <579>   DW_AT_prototyped  : 1
    <579>   DW_AT_type        : <0xd4>
    <57d>   DW_AT_low_pc      : 0x8001060
    <581>   DW_AT_high_pc     : 0x178
    <585>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <587>   DW_AT_call_all_tail_calls: 1
    <587>   DW_AT_sibling     : <0x5aa>
 <2><58b>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <58c>   DW_AT_name        : (indirect string, offset: 0xc520): pxBuffer
    <590>   DW_AT_decl_file   : 1
    <591>   DW_AT_decl_line   : 25
    <592>   DW_AT_decl_column : 65
    <593>   DW_AT_type        : <0x5aa>
    <597>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><59a>: Abbrev Number: 25 (DW_TAG_variable)
    <59b>   DW_AT_name        : (indirect string, offset: 0x34e11): pxRingBuffer
    <59f>   DW_AT_decl_file   : 1
    <5a0>   DW_AT_decl_line   : 27
    <5a1>   DW_AT_decl_column : 21
    <5a2>   DW_AT_type        : <0x5af>
    <5a6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5a9>: Abbrev Number: 0
 <1><5aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <5ab>   DW_AT_byte_size   : 4
    <5ab>   DW_AT_type        : <0x481>
 <1><5af>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <5b0>   DW_AT_byte_size   : 4
    <5b0>   DW_AT_type        : <0x404>
 <1><5b4>: Abbrev Number: 0
  Compilation Unit @ offset 0x5b5:
   Length:        0x381 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x181
   Pointer Size:  4
 <0><5c1>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <5c2>   DW_AT_producer    : (indirect string, offset: 0xd879e): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <5c6>   DW_AT_language    : 29	(C11)
    <5c7>   DW_AT_name        : (indirect string, offset: 0xdd1f3): ../Core/Src/TraceRecorder/trcCounter.c
    <5cb>   DW_AT_comp_dir    : (indirect string, offset: 0x480ef): D:/Embedded-C/RTOS course/RTOS_Workspace/Line_follower_obstacle_avoiding_robot/Debug
    <5cf>   DW_AT_ranges      : 0x26
    <5d3>   DW_AT_low_pc      : 0
    <5d7>   DW_AT_stmt_list   : 0xeb2
    <5db>   DW_AT_macros      : 0x22215
 <1><5df>: Abbrev Number: 3 (DW_TAG_base_type)
    <5e0>   DW_AT_byte_size   : 1
    <5e1>   DW_AT_encoding    : 6	(signed char)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x6ceec): signed char
 <1><5e6>: Abbrev Number: 3 (DW_TAG_base_type)
    <5e7>   DW_AT_byte_size   : 1
    <5e8>   DW_AT_encoding    : 8	(unsigned char)
    <5e9>   DW_AT_name        : (indirect string, offset: 0xd4318): unsigned char
 <1><5ed>: Abbrev Number: 3 (DW_TAG_base_type)
    <5ee>   DW_AT_byte_size   : 2
    <5ef>   DW_AT_encoding    : 5	(signed)
    <5f0>   DW_AT_name        : (indirect string, offset: 0xa3ae2): short int
 <1><5f4>: Abbrev Number: 3 (DW_TAG_base_type)
    <5f5>   DW_AT_byte_size   : 2
    <5f6>   DW_AT_encoding    : 7	(unsigned)
    <5f7>   DW_AT_name        : (indirect string, offset: 0xd2c2c): short unsigned int
 <1><5fb>: Abbrev Number: 1 (DW_TAG_typedef)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xdd252): __int32_t
    <600>   DW_AT_decl_file   : 2
    <601>   DW_AT_decl_line   : 77
    <602>   DW_AT_decl_column : 24
    <603>   DW_AT_type        : <0x607>
 <1><607>: Abbrev Number: 3 (DW_TAG_base_type)
    <608>   DW_AT_byte_size   : 4
    <609>   DW_AT_encoding    : 5	(signed)
    <60a>   DW_AT_name        : (indirect string, offset: 0x12b08): long int
 <1><60e>: Abbrev Number: 1 (DW_TAG_typedef)
    <60f>   DW_AT_name        : (indirect string, offset: 0x8b17f): __uint32_t
    <613>   DW_AT_decl_file   : 2
    <614>   DW_AT_decl_line   : 79
    <615>   DW_AT_decl_column : 25
    <616>   DW_AT_type        : <0x61a>
 <1><61a>: Abbrev Number: 3 (DW_TAG_base_type)
    <61b>   DW_AT_byte_size   : 4
    <61c>   DW_AT_encoding    : 7	(unsigned)
    <61d>   DW_AT_name        : (indirect string, offset: 0x52f47): long unsigned int
 <1><621>: Abbrev Number: 3 (DW_TAG_base_type)
    <622>   DW_AT_byte_size   : 8
    <623>   DW_AT_encoding    : 5	(signed)
    <624>   DW_AT_name        : (indirect string, offset: 0x63325): long long int
 <1><628>: Abbrev Number: 3 (DW_TAG_base_type)
    <629>   DW_AT_byte_size   : 8
    <62a>   DW_AT_encoding    : 7	(unsigned)
    <62b>   DW_AT_name        : (indirect string, offset: 0x2de87): long long unsigned int
 <1><62f>: Abbrev Number: 15 (DW_TAG_base_type)
    <630>   DW_AT_byte_size   : 4
    <631>   DW_AT_encoding    : 5	(signed)
    <632>   DW_AT_name        : int
 <1><636>: Abbrev Number: 3 (DW_TAG_base_type)
    <637>   DW_AT_byte_size   : 4
    <638>   DW_AT_encoding    : 7	(unsigned)
    <639>   DW_AT_name        : (indirect string, offset: 0x1206a): unsigned int
 <1><63d>: Abbrev Number: 1 (DW_TAG_typedef)
    <63e>   DW_AT_name        : (indirect string, offset: 0x52c84): int32_t
    <642>   DW_AT_decl_file   : 3
    <643>   DW_AT_decl_line   : 44
    <644>   DW_AT_decl_column : 19
    <645>   DW_AT_type        : <0x5fb>
 <1><649>: Abbrev Number: 1 (DW_TAG_typedef)
    <64a>   DW_AT_name        : (indirect string, offset: 0x6656d): uint32_t
    <64e>   DW_AT_decl_file   : 3
    <64f>   DW_AT_decl_line   : 48
    <650>   DW_AT_decl_column : 20
    <651>   DW_AT_type        : <0x60e>
 <1><655>: Abbrev Number: 3 (DW_TAG_base_type)
    <656>   DW_AT_byte_size   : 8
    <657>   DW_AT_encoding    : 4	(float)
    <658>   DW_AT_name        : (indirect string, offset: 0x4f264): long double
 <1><65c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <65d>   DW_AT_byte_size   : 4
 <1><65e>: Abbrev Number: 8 (DW_TAG_const_type)
    <65f>   DW_AT_type        : <0x65c>
 <1><663>: Abbrev Number: 1 (DW_TAG_typedef)
    <664>   DW_AT_name        : (indirect string, offset: 0xd97aa): TraceUnsignedBaseType_t
    <668>   DW_AT_decl_file   : 4
    <669>   DW_AT_decl_line   : 30
    <66a>   DW_AT_decl_column : 32
    <66b>   DW_AT_type        : <0x649>
 <1><66f>: Abbrev Number: 8 (DW_TAG_const_type)
    <670>   DW_AT_type        : <0x663>
 <1><674>: Abbrev Number: 1 (DW_TAG_typedef)
    <675>   DW_AT_name        : (indirect string, offset: 0xdd2da): TraceBaseType_t
    <679>   DW_AT_decl_file   : 4
    <67a>   DW_AT_decl_line   : 32
    <67b>   DW_AT_decl_column : 23
    <67c>   DW_AT_type        : <0x63d>
 <1><680>: Abbrev Number: 1 (DW_TAG_typedef)
    <681>   DW_AT_name        : (indirect string, offset: 0xdd21a): TraceHandleBaseType_t
    <685>   DW_AT_decl_file   : 4
    <686>   DW_AT_decl_line   : 35
    <687>   DW_AT_decl_column : 15
    <688>   DW_AT_type        : <0x65c>
 <1><68c>: Abbrev Number: 1 (DW_TAG_typedef)
    <68d>   DW_AT_name        : (indirect string, offset: 0x61029): traceResult
    <691>   DW_AT_decl_file   : 4
    <692>   DW_AT_decl_line   : 40
    <693>   DW_AT_decl_column : 33
    <694>   DW_AT_type        : <0x663>
 <1><698>: Abbrev Number: 1 (DW_TAG_typedef)
    <699>   DW_AT_name        : (indirect string, offset: 0xdd171): TraceEntryHandle_t
    <69d>   DW_AT_decl_file   : 4
    <69e>   DW_AT_decl_line   : 46
    <69f>   DW_AT_decl_column : 31
    <6a0>   DW_AT_type        : <0x680>
 <1><6a4>: Abbrev Number: 1 (DW_TAG_typedef)
    <6a5>   DW_AT_name        : (indirect string, offset: 0xdd1ce): TraceObjectHandle_t
    <6a9>   DW_AT_decl_file   : 4
    <6aa>   DW_AT_decl_line   : 50
    <6ab>   DW_AT_decl_column : 31
    <6ac>   DW_AT_type        : <0x680>
 <1><6b0>: Abbrev Number: 1 (DW_TAG_typedef)
    <6b1>   DW_AT_name        : (indirect string, offset: 0xdd2ac): TraceCounterHandle_t
    <6b5>   DW_AT_decl_file   : 4
    <6b6>   DW_AT_decl_line   : 68
    <6b7>   DW_AT_decl_column : 31
    <6b8>   DW_AT_type        : <0x680>
 <1><6bc>: Abbrev Number: 1 (DW_TAG_typedef)
    <6bd>   DW_AT_name        : (indirect string, offset: 0xdd295): TraceCounterCallback_t
    <6c1>   DW_AT_decl_file   : 4
    <6c2>   DW_AT_decl_line   : 78
    <6c3>   DW_AT_decl_column : 16
    <6c4>   DW_AT_type        : <0x6cd>
 <1><6c8>: Abbrev Number: 8 (DW_TAG_const_type)
    <6c9>   DW_AT_type        : <0x6bc>
 <1><6cd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6ce>   DW_AT_byte_size   : 4
    <6ce>   DW_AT_type        : <0x6d2>
 <1><6d2>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <6d3>   DW_AT_prototyped  : 1
    <6d3>   DW_AT_sibling     : <0x6dd>
 <2><6d7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6d8>   DW_AT_type        : <0x6b0>
 <2><6dc>: Abbrev Number: 0
 <1><6dd>: Abbrev Number: 3 (DW_TAG_base_type)
    <6de>   DW_AT_byte_size   : 1
    <6df>   DW_AT_encoding    : 8	(unsigned char)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x47064): char
 <1><6e4>: Abbrev Number: 8 (DW_TAG_const_type)
    <6e5>   DW_AT_type        : <0x6dd>
 <1><6e9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6ea>   DW_AT_byte_size   : 4
    <6ea>   DW_AT_type        : <0x6e4>
 <1><6ee>: Abbrev Number: 10 (DW_TAG_array_type)
    <6ef>   DW_AT_type        : <0x663>
    <6f3>   DW_AT_sibling     : <0x6fe>
 <2><6f7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <6f8>   DW_AT_type        : <0x636>
    <6fc>   DW_AT_upper_bound : 2
 <2><6fd>: Abbrev Number: 0
 <1><6fe>: Abbrev Number: 12 (DW_TAG_structure_type)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x7cf88): TraceEntry
    <703>   DW_AT_byte_size   : 48
    <704>   DW_AT_decl_file   : 5
    <705>   DW_AT_decl_line   : 67
    <706>   DW_AT_decl_column : 16
    <706>   DW_AT_sibling     : <0x73f>
 <2><70a>: Abbrev Number: 6 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0xaca7f): pvAddress
    <70f>   DW_AT_decl_file   : 5
    <710>   DW_AT_decl_line   : 69
    <711>   DW_AT_decl_column : 8
    <712>   DW_AT_type        : <0x65c>
    <716>   DW_AT_data_member_location: 0
 <2><717>: Abbrev Number: 6 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0xe114b): xStates
    <71c>   DW_AT_decl_file   : 5
    <71d>   DW_AT_decl_line   : 70
    <71e>   DW_AT_decl_column : 26
    <71f>   DW_AT_type        : <0x6ee>
    <723>   DW_AT_data_member_location: 4
 <2><724>: Abbrev Number: 6 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0xbaa64): uiOptions
    <729>   DW_AT_decl_file   : 5
    <72a>   DW_AT_decl_line   : 71
    <72b>   DW_AT_decl_column : 11
    <72c>   DW_AT_type        : <0x649>
    <730>   DW_AT_data_member_location: 16
 <2><731>: Abbrev Number: 6 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x48baf): szSymbol
    <736>   DW_AT_decl_file   : 5
    <737>   DW_AT_decl_line   : 72
    <738>   DW_AT_decl_column : 7
    <739>   DW_AT_type        : <0x73f>
    <73d>   DW_AT_data_member_location: 20
 <2><73e>: Abbrev Number: 0
 <1><73f>: Abbrev Number: 10 (DW_TAG_array_type)
    <740>   DW_AT_type        : <0x6dd>
    <744>   DW_AT_sibling     : <0x74f>
 <2><748>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <749>   DW_AT_type        : <0x636>
    <74d>   DW_AT_upper_bound : 27
 <2><74e>: Abbrev Number: 0
 <1><74f>: Abbrev Number: 1 (DW_TAG_typedef)
    <750>   DW_AT_name        : (indirect string, offset: 0xd1c77): TraceEntry_t
    <754>   DW_AT_decl_file   : 5
    <755>   DW_AT_decl_line   : 73
    <756>   DW_AT_decl_column : 3
    <757>   DW_AT_type        : <0x6fe>
 <1><75b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <75c>   DW_AT_name        : (indirect string, offset: 0xdd1e2): TraceCounterData
    <760>   DW_AT_byte_size   : 4
    <761>   DW_AT_decl_file   : 6
    <762>   DW_AT_decl_line   : 36
    <763>   DW_AT_decl_column : 16
    <763>   DW_AT_sibling     : <0x775>
 <2><767>: Abbrev Number: 6 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0xed2fe): xCallbackFunction
    <76c>   DW_AT_decl_file   : 6
    <76d>   DW_AT_decl_line   : 38
    <76e>   DW_AT_decl_column : 25
    <76f>   DW_AT_type        : <0x6bc>
    <773>   DW_AT_data_member_location: 0
 <2><774>: Abbrev Number: 0
 <1><775>: Abbrev Number: 1 (DW_TAG_typedef)
    <776>   DW_AT_name        : (indirect string, offset: 0xdd195): TraceCounterData_t
    <77a>   DW_AT_decl_file   : 6
    <77b>   DW_AT_decl_line   : 39
    <77c>   DW_AT_decl_column : 3
    <77d>   DW_AT_type        : <0x75b>
 <1><781>: Abbrev Number: 18 (DW_TAG_variable)
    <782>   DW_AT_name        : (indirect string, offset: 0xdd230): RecorderInitialized
    <786>   DW_AT_decl_file   : 9
    <787>   DW_AT_decl_line   : 1655
    <789>   DW_AT_decl_column : 17
    <78a>   DW_AT_type        : <0x649>
    <78e>   DW_AT_external    : 1
    <78e>   DW_AT_declaration : 1
 <1><78e>: Abbrev Number: 7 (DW_TAG_variable)
    <78f>   DW_AT_name        : (indirect string, offset: 0xdd1c0): pxCounterData
    <793>   DW_AT_decl_file   : 1
    <793>   DW_AT_decl_line   : 15
    <794>   DW_AT_decl_column : 28
    <795>   DW_AT_type        : <0x79f>
    <799>   DW_AT_location    : 5 byte block: 3 10 2 0 20 	(DW_OP_addr: 20000210)
 <1><79f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7a0>   DW_AT_byte_size   : 4
    <7a0>   DW_AT_type        : <0x775>
 <1><7a4>: Abbrev Number: 9 (DW_TAG_subprogram)
    <7a5>   DW_AT_external    : 1
    <7a5>   DW_AT_name        : (indirect string, offset: 0xdd2ea): xTraceEventCreate1
    <7a9>   DW_AT_decl_file   : 7
    <7aa>   DW_AT_decl_line   : 160
    <7ab>   DW_AT_decl_column : 13
    <7ab>   DW_AT_prototyped  : 1
    <7ab>   DW_AT_type        : <0x68c>
    <7af>   DW_AT_declaration : 1
    <7af>   DW_AT_sibling     : <0x7be>
 <2><7b3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7b4>   DW_AT_type        : <0x649>
 <2><7b8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7b9>   DW_AT_type        : <0x663>
 <2><7bd>: Abbrev Number: 0
 <1><7be>: Abbrev Number: 9 (DW_TAG_subprogram)
    <7bf>   DW_AT_external    : 1
    <7bf>   DW_AT_name        : (indirect string, offset: 0xdd2fd): xTraceEventCreate2
    <7c3>   DW_AT_decl_file   : 7
    <7c4>   DW_AT_decl_line   : 172
    <7c5>   DW_AT_decl_column : 13
    <7c5>   DW_AT_prototyped  : 1
    <7c5>   DW_AT_type        : <0x68c>
    <7c9>   DW_AT_declaration : 1
    <7c9>   DW_AT_sibling     : <0x7dd>
 <2><7cd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7ce>   DW_AT_type        : <0x649>
 <2><7d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7d3>   DW_AT_type        : <0x663>
 <2><7d7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7d8>   DW_AT_type        : <0x663>
 <2><7dc>: Abbrev Number: 0
 <1><7dd>: Abbrev Number: 9 (DW_TAG_subprogram)
    <7de>   DW_AT_external    : 1
    <7de>   DW_AT_name        : (indirect string, offset: 0xdd268): xTraceObjectRegisterInternal
    <7e2>   DW_AT_decl_file   : 8
    <7e3>   DW_AT_decl_line   : 46
    <7e4>   DW_AT_decl_column : 13
    <7e4>   DW_AT_prototyped  : 1
    <7e4>   DW_AT_type        : <0x68c>
    <7e8>   DW_AT_declaration : 1
    <7e8>   DW_AT_sibling     : <0x810>
 <2><7ec>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7ed>   DW_AT_type        : <0x649>
 <2><7f1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f2>   DW_AT_type        : <0x65e>
 <2><7f6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7f7>   DW_AT_type        : <0x6e9>
 <2><7fb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7fc>   DW_AT_type        : <0x663>
 <2><800>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <801>   DW_AT_type        : <0x810>
 <2><805>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <806>   DW_AT_type        : <0x663>
 <2><80a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <80b>   DW_AT_type        : <0x815>
 <2><80f>: Abbrev Number: 0
 <1><810>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <811>   DW_AT_byte_size   : 4
    <811>   DW_AT_type        : <0x66f>
 <1><815>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <816>   DW_AT_byte_size   : 4
    <816>   DW_AT_type        : <0x6a4>
 <1><81a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <81b>   DW_AT_external    : 1
    <81b>   DW_AT_name        : (indirect string, offset: 0xdd184): xTraceCounterSet
    <81f>   DW_AT_decl_file   : 1
    <81f>   DW_AT_decl_line   : 69
    <820>   DW_AT_decl_column : 13
    <820>   DW_AT_prototyped  : 1
    <820>   DW_AT_type        : <0x68c>
    <824>   DW_AT_low_pc      : 0
    <828>   DW_AT_high_pc     : 0x74
    <82c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <82e>   DW_AT_call_all_tail_calls: 1
    <82e>   DW_AT_sibling     : <0x86b>
 <2><832>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <833>   DW_AT_name        : (indirect string, offset: 0xdd286): xCounterHandle
    <837>   DW_AT_decl_file   : 1
    <837>   DW_AT_decl_line   : 69
    <838>   DW_AT_decl_column : 51
    <839>   DW_AT_type        : <0x6b0>
    <83d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><840>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <841>   DW_AT_name        : (indirect string, offset: 0xdd3c1): xValue
    <845>   DW_AT_decl_file   : 1
    <845>   DW_AT_decl_line   : 69
    <846>   DW_AT_decl_column : 83
    <847>   DW_AT_type        : <0x674>
    <84b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><84e>: Abbrev Number: 7 (DW_TAG_variable)
    <84f>   DW_AT_name        : (indirect string, offset: 0xdd310): xLowerLimit
    <853>   DW_AT_decl_file   : 1
    <853>   DW_AT_decl_line   : 71
    <854>   DW_AT_decl_column : 18
    <855>   DW_AT_type        : <0x674>
    <859>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><85c>: Abbrev Number: 7 (DW_TAG_variable)
    <85d>   DW_AT_name        : (indirect string, offset: 0xdd25c): xUpperLimit
    <861>   DW_AT_decl_file   : 1
    <861>   DW_AT_decl_line   : 72
    <862>   DW_AT_decl_column : 18
    <863>   DW_AT_type        : <0x674>
    <867>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><86a>: Abbrev Number: 0
 <1><86b>: Abbrev Number: 13 (DW_TAG_subprogram)
    <86c>   DW_AT_external    : 1
    <86c>   DW_AT_name        : (indirect string, offset: 0xdd31c): xTraceCounterCreate
    <870>   DW_AT_decl_file   : 1
    <870>   DW_AT_decl_line   : 42
    <871>   DW_AT_decl_column : 13
    <871>   DW_AT_prototyped  : 1
    <871>   DW_AT_type        : <0x68c>
    <875>   DW_AT_low_pc      : 0
    <879>   DW_AT_high_pc     : 0x5e
    <87d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <87f>   DW_AT_call_all_tail_calls: 1
    <87f>   DW_AT_sibling     : <0x8e6>
 <2><883>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <884>   DW_AT_name        : (indirect string, offset: 0xdf1b5): szName
    <888>   DW_AT_decl_file   : 1
    <888>   DW_AT_decl_line   : 42
    <889>   DW_AT_decl_column : 45
    <88a>   DW_AT_type        : <0x6e9>
    <88e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><891>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <892>   DW_AT_name        : (indirect string, offset: 0xdd244): xInitialValue
    <896>   DW_AT_decl_file   : 1
    <896>   DW_AT_decl_line   : 42
    <897>   DW_AT_decl_column : 69
    <898>   DW_AT_type        : <0x674>
    <89c>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><89f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xdd310): xLowerLimit
    <8a4>   DW_AT_decl_file   : 1
    <8a4>   DW_AT_decl_line   : 42
    <8a5>   DW_AT_decl_column : 100
    <8a6>   DW_AT_type        : <0x674>
    <8aa>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><8ad>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xdd25c): xUpperLimit
    <8b2>   DW_AT_decl_file   : 1
    <8b2>   DW_AT_decl_line   : 42
    <8b3>   DW_AT_decl_column : 129
    <8b4>   DW_AT_type        : <0x674>
    <8b8>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><8bb>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8bc>   DW_AT_name        : (indirect string, offset: 0xdd285): pxCounterHandle
    <8c0>   DW_AT_decl_file   : 1
    <8c0>   DW_AT_decl_line   : 42
    <8c1>   DW_AT_decl_column : 164
    <8c2>   DW_AT_type        : <0x8e6>
    <8c6>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><8c9>: Abbrev Number: 7 (DW_TAG_variable)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xe10a6): xObjectHandle
    <8ce>   DW_AT_decl_file   : 1
    <8ce>   DW_AT_decl_line   : 44
    <8cf>   DW_AT_decl_column : 22
    <8d0>   DW_AT_type        : <0x6a4>
    <8d4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8d7>: Abbrev Number: 7 (DW_TAG_variable)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xe114a): uxStates
    <8dc>   DW_AT_decl_file   : 1
    <8dc>   DW_AT_decl_line   : 45
    <8dd>   DW_AT_decl_column : 26
    <8de>   DW_AT_type        : <0x6ee>
    <8e2>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><8e5>: Abbrev Number: 0
 <1><8e6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8e7>   DW_AT_byte_size   : 4
    <8e7>   DW_AT_type        : <0x6b0>
 <1><8eb>: Abbrev Number: 19 (DW_TAG_subprogram)
    <8ec>   DW_AT_external    : 1
    <8ec>   DW_AT_name        : (indirect string, offset: 0xdd2c1): xTraceCounterSetCallback
    <8f0>   DW_AT_decl_file   : 1
    <8f1>   DW_AT_decl_line   : 30
    <8f2>   DW_AT_decl_column : 13
    <8f3>   DW_AT_prototyped  : 1
    <8f3>   DW_AT_type        : <0x68c>
    <8f7>   DW_AT_low_pc      : 0
    <8fb>   DW_AT_high_pc     : 0x24
    <8ff>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <901>   DW_AT_call_all_calls: 1
    <901>   DW_AT_sibling     : <0x914>
 <2><905>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <906>   DW_AT_name        : (indirect string, offset: 0xed2c7): xCallback
    <90a>   DW_AT_decl_file   : 1
    <90a>   DW_AT_decl_line   : 30
    <90b>   DW_AT_decl_column : 67
    <90c>   DW_AT_type        : <0x6c8>
    <910>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><913>: Abbrev Number: 0
 <1><914>: Abbrev Number: 20 (DW_TAG_subprogram)
    <915>   DW_AT_external    : 1
    <915>   DW_AT_name        : (indirect string, offset: 0xdd1a8): xTraceCounterInitialize
    <919>   DW_AT_decl_file   : 1
    <91a>   DW_AT_decl_line   : 17
    <91b>   DW_AT_decl_column : 13
    <91c>   DW_AT_prototyped  : 1
    <91c>   DW_AT_type        : <0x68c>
    <920>   DW_AT_low_pc      : 0x80011f0
    <924>   DW_AT_high_pc     : 0x38
    <928>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <92a>   DW_AT_call_all_calls: 1
 <2><92a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <92b>   DW_AT_name        : (indirect string, offset: 0xc520): pxBuffer
    <92f>   DW_AT_decl_file   : 1
    <92f>   DW_AT_decl_line   : 17
    <930>   DW_AT_decl_column : 57
    <931>   DW_AT_type        : <0x79f>
    <935>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 0
  Compilation Unit @ offset 0x93a:
   Length:        0x321 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2bf
   Pointer Size:  4
 <0><946>: Abbrev Number: 8 (DW_TAG_compile_unit)
    <947>   DW_AT_producer    : (indirect string, offset: 0xd879e): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <94b>   DW_AT_language    : 29	(C11)
    <94c>   DW_AT_name        : (indirect string, offset: 0xdd372): ../Core/Src/TraceRecorder/trcDiagnostics.c
    <950>   DW_AT_comp_dir    : (indirect string, offset: 0x480ef): D:/Embedded-C/RTOS course/RTOS_Workspace/Line_follower_obstacle_avoiding_robot/Debug
    <954>   DW_AT_ranges      : 0x4b
    <958>   DW_AT_low_pc      : 0
    <95c>   DW_AT_stmt_list   : 0x1d6a
    <960>   DW_AT_macros      : 0x22692
 <1><964>: Abbrev Number: 2 (DW_TAG_base_type)
    <965>   DW_AT_byte_size   : 1
    <966>   DW_AT_encoding    : 6	(signed char)
    <967>   DW_AT_name        : (indirect string, offset: 0x6ceec): signed char
 <1><96b>: Abbrev Number: 2 (DW_TAG_base_type)
    <96c>   DW_AT_byte_size   : 1
    <96d>   DW_AT_encoding    : 8	(unsigned char)
    <96e>   DW_AT_name        : (indirect string, offset: 0xd4318): unsigned char
 <1><972>: Abbrev Number: 2 (DW_TAG_base_type)
    <973>   DW_AT_byte_size   : 2
    <974>   DW_AT_encoding    : 5	(signed)
    <975>   DW_AT_name        : (indirect string, offset: 0xa3ae2): short int
 <1><979>: Abbrev Number: 2 (DW_TAG_base_type)
    <97a>   DW_AT_byte_size   : 2
    <97b>   DW_AT_encoding    : 7	(unsigned)
    <97c>   DW_AT_name        : (indirect string, offset: 0xd2c2c): short unsigned int
 <1><980>: Abbrev Number: 3 (DW_TAG_typedef)
    <981>   DW_AT_name        : (indirect string, offset: 0xdd252): __int32_t
    <985>   DW_AT_decl_file   : 2
    <986>   DW_AT_decl_line   : 77
    <987>   DW_AT_decl_column : 24
    <988>   DW_AT_type        : <0x98c>
 <1><98c>: Abbrev Number: 2 (DW_TAG_base_type)
    <98d>   DW_AT_byte_size   : 4
    <98e>   DW_AT_encoding    : 5	(signed)
    <98f>   DW_AT_name        : (indirect string, offset: 0x12b08): long int
 <1><993>: Abbrev Number: 3 (DW_TAG_typedef)
    <994>   DW_AT_name        : (indirect string, offset: 0x8b17f): __uint32_t
    <998>   DW_AT_decl_file   : 2
    <999>   DW_AT_decl_line   : 79
    <99a>   DW_AT_decl_column : 25
    <99b>   DW_AT_type        : <0x99f>
 <1><99f>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a0>   DW_AT_byte_size   : 4
    <9a1>   DW_AT_encoding    : 7	(unsigned)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x52f47): long unsigned int
 <1><9a6>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a7>   DW_AT_byte_size   : 8
    <9a8>   DW_AT_encoding    : 5	(signed)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x63325): long long int
 <1><9ad>: Abbrev Number: 2 (DW_TAG_base_type)
    <9ae>   DW_AT_byte_size   : 8
    <9af>   DW_AT_encoding    : 7	(unsigned)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x2de87): long long unsigned int
 <1><9b4>: Abbrev Number: 9 (DW_TAG_base_type)
    <9b5>   DW_AT_byte_size   : 4
    <9b6>   DW_AT_encoding    : 5	(signed)
    <9b7>   DW_AT_name        : int
 <1><9bb>: Abbrev Number: 2 (DW_TAG_base_type)
    <9bc>   DW_AT_byte_size   : 4
    <9bd>   DW_AT_encoding    : 7	(unsigned)
    <9be>   DW_AT_name        : (indirect string, offset: 0x1206a): unsigned int
 <1><9c2>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x52c84): int32_t
    <9c7>   DW_AT_decl_file   : 3
    <9c8>   DW_AT_decl_line   : 44
    <9c9>   DW_AT_decl_column : 19
    <9ca>   DW_AT_type        : <0x980>
 <1><9ce>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x6656d): uint32_t
    <9d3>   DW_AT_decl_file   : 3
    <9d4>   DW_AT_decl_line   : 48
    <9d5>   DW_AT_decl_column : 20
    <9d6>   DW_AT_type        : <0x993>
 <1><9da>: Abbrev Number: 2 (DW_TAG_base_type)
    <9db>   DW_AT_byte_size   : 8
    <9dc>   DW_AT_encoding    : 4	(float)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x4f264): long double
 <1><9e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e2>   DW_AT_name        : (indirect string, offset: 0xd97aa): TraceUnsignedBaseType_t
    <9e6>   DW_AT_decl_file   : 4
    <9e7>   DW_AT_decl_line   : 30
    <9e8>   DW_AT_decl_column : 32
    <9e9>   DW_AT_type        : <0x9ce>
 <1><9ed>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ee>   DW_AT_name        : (indirect string, offset: 0xdd2da): TraceBaseType_t
    <9f2>   DW_AT_decl_file   : 4
    <9f3>   DW_AT_decl_line   : 32
    <9f4>   DW_AT_decl_column : 23
    <9f5>   DW_AT_type        : <0x9c2>
 <1><9f9>: Abbrev Number: 3 (DW_TAG_typedef)
    <9fa>   DW_AT_name        : (indirect string, offset: 0x61029): traceResult
    <9fe>   DW_AT_decl_file   : 4
    <9ff>   DW_AT_decl_line   : 40
    <a00>   DW_AT_decl_column : 33
    <a01>   DW_AT_type        : <0x9e1>
 <1><a05>: Abbrev Number: 2 (DW_TAG_base_type)
    <a06>   DW_AT_byte_size   : 1
    <a07>   DW_AT_encoding    : 8	(unsigned char)
    <a08>   DW_AT_name        : (indirect string, offset: 0x47064): char
 <1><a0c>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <a0d>   DW_AT_name        : (indirect string, offset: 0xdd35d): TraceDiagnosticsType
    <a11>   DW_AT_encoding    : 7	(unsigned)
    <a12>   DW_AT_byte_size   : 1
    <a13>   DW_AT_type        : <0x96b>
    <a17>   DW_AT_decl_file   : 5
    <a18>   DW_AT_decl_line   : 28
    <a19>   DW_AT_decl_column : 14
    <a1a>   DW_AT_sibling     : <0xa3d>
 <2><a1e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xdd4f9): TRC_DIAGNOSTICS_ENTRY_SYMBOL_LONGEST_LENGTH
    <a23>   DW_AT_const_value : 0
 <2><a24>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a25>   DW_AT_name        : (indirect string, offset: 0xdd3c8): TRC_DIAGNOSTICS_ENTRY_SLOTS_NO_ROOM
    <a29>   DW_AT_const_value : 1
 <2><a2a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a2b>   DW_AT_name        : (indirect string, offset: 0xdd45b): TRC_DIAGNOSTICS_BLOB_MAX_BYTES_TRUNCATED
    <a2f>   DW_AT_const_value : 2
 <2><a30>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a31>   DW_AT_name        : (indirect string, offset: 0xdd4b0): TRC_DIAGNOSTICS_STACK_MONITOR_NO_SLOTS
    <a35>   DW_AT_const_value : 3
 <2><a36>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a37>   DW_AT_name        : (indirect string, offset: 0xdd4d7): TRC_DIAGNOSTICS_ASSERTS_TRIGGERED
    <a3b>   DW_AT_const_value : 4
 <2><a3c>: Abbrev Number: 0
 <1><a3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <a3e>   DW_AT_name        : (indirect string, offset: 0xdd346): TraceDiagnosticsType_t
    <a42>   DW_AT_decl_file   : 5
    <a43>   DW_AT_decl_line   : 35
    <a44>   DW_AT_decl_column : 3
    <a45>   DW_AT_type        : <0xa0c>
 <1><a49>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a4a>   DW_AT_name        : (indirect string, offset: 0xdd525): TraceDiagnostics
    <a4e>   DW_AT_byte_size   : 20
    <a4f>   DW_AT_decl_file   : 5
    <a50>   DW_AT_decl_line   : 37
    <a51>   DW_AT_decl_column : 16
    <a52>   DW_AT_sibling     : <0xa64>
 <2><a56>: Abbrev Number: 12 (DW_TAG_member)
    <a57>   DW_AT_name        : (indirect string, offset: 0xdd33e): metrics
    <a5b>   DW_AT_decl_file   : 5
    <a5c>   DW_AT_decl_line   : 39
    <a5d>   DW_AT_decl_column : 18
    <a5e>   DW_AT_type        : <0xa64>
    <a62>   DW_AT_data_member_location: 0
 <2><a63>: Abbrev Number: 0
 <1><a64>: Abbrev Number: 13 (DW_TAG_array_type)
    <a65>   DW_AT_type        : <0x9ed>
    <a69>   DW_AT_sibling     : <0xa74>
 <2><a6d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <a6e>   DW_AT_type        : <0x9bb>
    <a72>   DW_AT_upper_bound : 4
 <2><a73>: Abbrev Number: 0
 <1><a74>: Abbrev Number: 3 (DW_TAG_typedef)
    <a75>   DW_AT_name        : (indirect string, offset: 0xdd484): TraceDiagnosticsData_t
    <a79>   DW_AT_decl_file   : 5
    <a7a>   DW_AT_decl_line   : 40
    <a7b>   DW_AT_decl_column : 3
    <a7c>   DW_AT_type        : <0xa49>
 <1><a80>: Abbrev Number: 15 (DW_TAG_variable)
    <a81>   DW_AT_name        : (indirect string, offset: 0xdd230): RecorderInitialized
    <a85>   DW_AT_decl_file   : 6
    <a86>   DW_AT_decl_line   : 1655
    <a88>   DW_AT_decl_column : 17
    <a89>   DW_AT_type        : <0x9ce>
    <a8d>   DW_AT_external    : 1
    <a8d>   DW_AT_declaration : 1
 <1><a8d>: Abbrev Number: 16 (DW_TAG_variable)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xdd438): pxDiagnostics
    <a92>   DW_AT_decl_file   : 1
    <a93>   DW_AT_decl_line   : 15
    <a94>   DW_AT_decl_column : 32
    <a95>   DW_AT_type        : <0xa9f>
    <a99>   DW_AT_location    : 5 byte block: 3 14 2 0 20 	(DW_OP_addr: 20000214)
 <1><a9f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <aa0>   DW_AT_byte_size   : 4
    <aa0>   DW_AT_type        : <0xa74>
 <1><aa4>: Abbrev Number: 17 (DW_TAG_subprogram)
    <aa5>   DW_AT_external    : 1
    <aa5>   DW_AT_name        : (indirect string, offset: 0xdd330): xTraceWarning
    <aa9>   DW_AT_decl_file   : 7
    <aaa>   DW_AT_decl_line   : 57
    <aab>   DW_AT_decl_column : 13
    <aac>   DW_AT_prototyped  : 1
    <aac>   DW_AT_type        : <0x9f9>
    <ab0>   DW_AT_declaration : 1
    <ab0>   DW_AT_sibling     : <0xaba>
 <2><ab4>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <ab5>   DW_AT_type        : <0x9ce>
 <2><ab9>: Abbrev Number: 0
 <1><aba>: Abbrev Number: 19 (DW_TAG_subprogram)
    <abb>   DW_AT_external    : 1
    <abb>   DW_AT_name        : (indirect string, offset: 0xdd3a3): xTraceDiagnosticsCheckStatus
    <abf>   DW_AT_decl_file   : 1
    <ac0>   DW_AT_decl_line   : 120
    <ac1>   DW_AT_decl_column : 13
    <ac2>   DW_AT_prototyped  : 1
    <ac2>   DW_AT_type        : <0x9f9>
    <ac6>   DW_AT_low_pc      : 0x800130c
    <aca>   DW_AT_high_pc     : 0x84
    <ace>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ad0>   DW_AT_call_all_tail_calls: 1
 <1><ad0>: Abbrev Number: 5 (DW_TAG_subprogram)
    <ad1>   DW_AT_external    : 1
    <ad1>   DW_AT_name        : (indirect string, offset: 0xdd56c): xTraceDiagnosticsSetIfLower
    <ad5>   DW_AT_decl_file   : 1
    <ad5>   DW_AT_decl_line   : 104
    <ad6>   DW_AT_decl_column : 13
    <ad6>   DW_AT_prototyped  : 1
    <ad6>   DW_AT_type        : <0x9f9>
    <ada>   DW_AT_low_pc      : 0
    <ade>   DW_AT_high_pc     : 0x3c
    <ae2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae4>   DW_AT_call_all_calls: 1
    <ae4>   DW_AT_sibling     : <0xb05>
 <2><ae8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ae9>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <aed>   DW_AT_decl_file   : 1
    <aed>   DW_AT_decl_line   : 104
    <aee>   DW_AT_decl_column : 64
    <aef>   DW_AT_type        : <0xa3d>
    <af3>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><af6>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <af7>   DW_AT_name        : (indirect string, offset: 0xdd3c1): xValue
    <afb>   DW_AT_decl_file   : 1
    <afb>   DW_AT_decl_line   : 104
    <afc>   DW_AT_decl_column : 87
    <afd>   DW_AT_type        : <0x9ed>
    <b01>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b04>: Abbrev Number: 0
 <1><b05>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b06>   DW_AT_external    : 1
    <b06>   DW_AT_name        : (indirect string, offset: 0xdd3ec): xTraceDiagnosticsSetIfHigher
    <b0a>   DW_AT_decl_file   : 1
    <b0a>   DW_AT_decl_line   : 88
    <b0b>   DW_AT_decl_column : 13
    <b0b>   DW_AT_prototyped  : 1
    <b0b>   DW_AT_type        : <0x9f9>
    <b0f>   DW_AT_low_pc      : 0x80012d0
    <b13>   DW_AT_high_pc     : 0x3c
    <b17>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b19>   DW_AT_call_all_calls: 1
    <b19>   DW_AT_sibling     : <0xb3a>
 <2><b1d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b1e>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <b22>   DW_AT_decl_file   : 1
    <b22>   DW_AT_decl_line   : 88
    <b23>   DW_AT_decl_column : 65
    <b24>   DW_AT_type        : <0xa3d>
    <b28>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b2c>   DW_AT_name        : (indirect string, offset: 0xdd3c1): xValue
    <b30>   DW_AT_decl_file   : 1
    <b30>   DW_AT_decl_line   : 88
    <b31>   DW_AT_decl_column : 88
    <b32>   DW_AT_type        : <0x9ed>
    <b36>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b39>: Abbrev Number: 0
 <1><b3a>: Abbrev Number: 7 (DW_TAG_subprogram)
    <b3b>   DW_AT_external    : 1
    <b3b>   DW_AT_name        : (indirect string, offset: 0xdd552): xTraceDiagnosticsDecrease
    <b3f>   DW_AT_decl_file   : 1
    <b3f>   DW_AT_decl_line   : 83
    <b40>   DW_AT_decl_column : 13
    <b40>   DW_AT_prototyped  : 1
    <b40>   DW_AT_type        : <0x9f9>
    <b44>   DW_AT_low_pc      : 0
    <b48>   DW_AT_high_pc     : 0x20
    <b4c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4e>   DW_AT_call_all_tail_calls: 1
    <b4e>   DW_AT_sibling     : <0xb61>
 <2><b52>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b53>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <b57>   DW_AT_decl_file   : 1
    <b57>   DW_AT_decl_line   : 83
    <b58>   DW_AT_decl_column : 62
    <b59>   DW_AT_type        : <0xa3d>
    <b5d>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b60>: Abbrev Number: 0
 <1><b61>: Abbrev Number: 7 (DW_TAG_subprogram)
    <b62>   DW_AT_external    : 1
    <b62>   DW_AT_name        : (indirect string, offset: 0xdd41e): xTraceDiagnosticsIncrease
    <b66>   DW_AT_decl_file   : 1
    <b66>   DW_AT_decl_line   : 78
    <b67>   DW_AT_decl_column : 13
    <b67>   DW_AT_prototyped  : 1
    <b67>   DW_AT_type        : <0x9f9>
    <b6b>   DW_AT_low_pc      : 0x80012b0
    <b6f>   DW_AT_high_pc     : 0x1e
    <b73>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b75>   DW_AT_call_all_tail_calls: 1
    <b75>   DW_AT_sibling     : <0xb88>
 <2><b79>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b7a>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <b7e>   DW_AT_decl_file   : 1
    <b7e>   DW_AT_decl_line   : 78
    <b7f>   DW_AT_decl_column : 62
    <b80>   DW_AT_type        : <0xa3d>
    <b84>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b87>: Abbrev Number: 0
 <1><b88>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b89>   DW_AT_external    : 1
    <b89>   DW_AT_name        : (indirect string, offset: 0xdd49b): xTraceDiagnosticsAdd
    <b8d>   DW_AT_decl_file   : 1
    <b8d>   DW_AT_decl_line   : 65
    <b8e>   DW_AT_decl_column : 13
    <b8e>   DW_AT_prototyped  : 1
    <b8e>   DW_AT_type        : <0x9f9>
    <b92>   DW_AT_low_pc      : 0x8001278
    <b96>   DW_AT_high_pc     : 0x38
    <b9a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b9c>   DW_AT_call_all_calls: 1
    <b9c>   DW_AT_sibling     : <0xbbd>
 <2><ba0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <ba5>   DW_AT_decl_file   : 1
    <ba5>   DW_AT_decl_line   : 65
    <ba6>   DW_AT_decl_column : 57
    <ba7>   DW_AT_type        : <0xa3d>
    <bab>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><bae>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <baf>   DW_AT_name        : (indirect string, offset: 0xdd3c1): xValue
    <bb3>   DW_AT_decl_file   : 1
    <bb3>   DW_AT_decl_line   : 65
    <bb4>   DW_AT_decl_column : 80
    <bb5>   DW_AT_type        : <0x9ed>
    <bb9>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><bbc>: Abbrev Number: 0
 <1><bbd>: Abbrev Number: 5 (DW_TAG_subprogram)
    <bbe>   DW_AT_external    : 1
    <bbe>   DW_AT_name        : (indirect string, offset: 0xdd446): xTraceDiagnosticsSet
    <bc2>   DW_AT_decl_file   : 1
    <bc2>   DW_AT_decl_line   : 52
    <bc3>   DW_AT_decl_column : 13
    <bc3>   DW_AT_prototyped  : 1
    <bc3>   DW_AT_type        : <0x9f9>
    <bc7>   DW_AT_low_pc      : 0
    <bcb>   DW_AT_high_pc     : 0x2c
    <bcf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bd1>   DW_AT_call_all_calls: 1
    <bd1>   DW_AT_sibling     : <0xbf2>
 <2><bd5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <bd6>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <bda>   DW_AT_decl_file   : 1
    <bda>   DW_AT_decl_line   : 52
    <bdb>   DW_AT_decl_column : 57
    <bdc>   DW_AT_type        : <0xa3d>
    <be0>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><be3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <be4>   DW_AT_name        : (indirect string, offset: 0xdd3c1): xValue
    <be8>   DW_AT_decl_file   : 1
    <be8>   DW_AT_decl_line   : 52
    <be9>   DW_AT_decl_column : 80
    <bea>   DW_AT_type        : <0x9ed>
    <bee>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><bf1>: Abbrev Number: 0
 <1><bf2>: Abbrev Number: 5 (DW_TAG_subprogram)
    <bf3>   DW_AT_external    : 1
    <bf3>   DW_AT_name        : (indirect string, offset: 0xdd409): xTraceDiagnosticsGet
    <bf7>   DW_AT_decl_file   : 1
    <bf7>   DW_AT_decl_line   : 36
    <bf8>   DW_AT_decl_column : 13
    <bf8>   DW_AT_prototyped  : 1
    <bf8>   DW_AT_type        : <0x9f9>
    <bfc>   DW_AT_low_pc      : 0
    <c00>   DW_AT_high_pc     : 0x2c
    <c04>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c06>   DW_AT_call_all_calls: 1
    <c06>   DW_AT_sibling     : <0xc27>
 <2><c0a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c0b>   DW_AT_name        : (indirect string, offset: 0xdd39d): xType
    <c0f>   DW_AT_decl_file   : 1
    <c0f>   DW_AT_decl_line   : 36
    <c10>   DW_AT_decl_column : 57
    <c11>   DW_AT_type        : <0xa3d>
    <c15>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c18>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c19>   DW_AT_name        : (indirect string, offset: 0xdd3c0): pxValue
    <c1d>   DW_AT_decl_file   : 1
    <c1d>   DW_AT_decl_line   : 36
    <c1e>   DW_AT_decl_column : 81
    <c1f>   DW_AT_type        : <0xc27>
    <c23>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c26>: Abbrev Number: 0
 <1><c27>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c28>   DW_AT_byte_size   : 4
    <c28>   DW_AT_type        : <0x9ed>
 <1><c2c>: Abbrev Number: 20 (DW_TAG_subprogram)
    <c2d>   DW_AT_external    : 1
    <c2d>   DW_AT_name        : (indirect string, offset: 0xdd536): xTraceDiagnosticsInitialize
    <c31>   DW_AT_decl_file   : 1
    <c32>   DW_AT_decl_line   : 17
    <c33>   DW_AT_decl_column : 13
    <c34>   DW_AT_prototyped  : 1
    <c34>   DW_AT_type        : <0x9f9>
    <c38>   DW_AT_low_pc      : 0x8001228
    <c3c>   DW_AT_high_pc     : 0x50
    <c40>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c42>   DW_AT_call_all_calls: 1
 <2><c42>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <c43>   DW_AT_name        : (indirect string, offset: 0xc520): pxBuffer
    <c47>   DW_AT_decl_file   : 1
    <c47>   DW_AT_decl_line   : 17
    <c48>   DW_AT_decl_column : 65
    <c49>   DW_AT_type        : <0xa9f>
    <c4d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c50>: Abbrev Number: 21 (DW_TAG_variable)
    <c51>   DW_AT_name        : i
    <c53>   DW_AT_decl_file   : 1
    <c54>   DW_AT_decl_line   : 19
    <c55>   DW_AT_decl_column : 11
    <c56>   DW_AT_type        : <0x9ce>
    <c5a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c5d>: Abbrev Number: 0
 <1><c5e>: Abbrev Number: 0
  Compilation Unit @ offset 0xc5f:
   Length:        0x68b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x42f
   Pointer Size:  4
 <0><c6b>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <c6c>   DW_AT_producer    : (indirect string, offset: 0xd879e): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c70>   DW_AT_language    : 29	(C11)
    <c71>   DW_AT_name        : (indirect string, offset: 0xdd95d): ../Core/Src/TraceRecorder/trcEntryTable.c
    <c75>   DW_AT_comp_dir    : (indirect string, offset: 0x480ef): D:/Embedded-C/RTOS course/RTOS_Workspace/Line_follower_obstacle_avoiding_robot/Debug
    <c79>   DW_AT_ranges      : 0x8f
    <c7d>   DW_AT_low_pc      : 0
    <c81>   DW_AT_stmt_list   : 0x2cf2
    <c85>   DW_AT_macros      : 0x22b0f
 <1><c89>: Abbrev Number: 3 (DW_TAG_base_type)
    <c8a>   DW_AT_byte_size   : 1
    <c8b>   DW_AT_encoding    : 6	(signed char)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x6ceec): signed char
 <1><c90>: Abbrev Number: 1 (DW_TAG_typedef)
    <c91>   DW_AT_name        : (indirect string, offset: 0x3fc7a): __uint8_t
    <c95>   DW_AT_decl_file   : 3
    <c96>   DW_AT_decl_line   : 43
    <c97>   DW_AT_decl_column : 24
    <c98>   DW_AT_type        : <0xc9c>
 <1><c9c>: Abbrev Number: 3 (DW_TAG_base_type)
    <c9d>   DW_AT_byte_size   : 1
    <c9e>   DW_AT_encoding    : 8	(unsigned char)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xd4318): unsigned char
 <1><ca3>: Abbrev Number: 3 (DW_TAG_base_type)
    <ca4>   DW_AT_byte_size   : 2
    <ca5>   DW_AT_encoding    : 5	(signed)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xa3ae2): short int
 <1><caa>: Abbrev Number: 3 (DW_TAG_base_type)
    <cab>   DW_AT_byte_size   : 2
    <cac>   DW_AT_encoding    : 7	(unsigned)
    <cad>   DW_AT_name        : (indirect string, offset: 0xd2c2c): short unsigned int
 <1><cb1>: Abbrev Number: 1 (DW_TAG_typedef)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xdd252): __int32_t
    <cb6>   DW_AT_decl_file   : 3
    <cb7>   DW_AT_decl_line   : 77
    <cb8>   DW_AT_decl_column : 24
    <cb9>   DW_AT_type        : <0xcbd>
 <1><cbd>: Abbrev Number: 3 (DW_TAG_base_type)
    <cbe>   DW_AT_byte_size   : 4
    <cbf>   DW_AT_encoding    : 5	(signed)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x12b08): long int
 <1><cc4>: Abbrev Number: 1 (DW_TAG_typedef)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x8b17f): __uint32_t
    <cc9>   DW_AT_decl_file   : 3
    <cca>   DW_AT_decl_line   : 79
    <ccb>   DW_AT_decl_column : 25
    <ccc>   DW_AT_type        : <0xcd0>
 <1><cd0>: Abbrev Number: 3 (DW_TAG_base_type)
    <cd1>   DW_AT_byte_size   : 4
    <cd2>   DW_AT_encoding    : 7	(unsigned)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x52f47): long unsigned int
 <1><cd7>: Abbrev Number: 3 (DW_TAG_base_type)
    <cd8>   DW_AT_byte_size   : 8
    <cd9>   DW_AT_encoding    : 5	(signed)
    <cda>   DW_AT_name        : (indirect string, offset: 0x63325): long long int
 <1><cde>: Abbrev Number: 3 (DW_TAG_base_type)
    <cdf>   DW_AT_byte_size   : 8
    <ce0>   DW_AT_encoding    : 7	(unsigned)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x2de87): long long unsigned int
 <1><ce5>: Abbrev Number: 23 (DW_TAG_base_type)
    <ce6>   DW_AT_byte_size   : 4
    <ce7>   DW_AT_encoding    : 5	(signed)
    <ce8>   DW_AT_name        : int
 <1><cec>: Abbrev Number: 3 (DW_TAG_base_type)
    <ced>   DW_AT_byte_size   : 4
    <cee>   DW_AT_encoding    : 7	(unsigned)
    <cef>   DW_AT_name        : (indirect string, offset: 0x1206a): unsigned int
 <1><cf3>: Abbrev Number: 1 (DW_TAG_typedef)
    <cf4>   DW_AT_name        : (indirect string, offset: 0x3fc7c): uint8_t
    <cf8>   DW_AT_decl_file   : 4
    <cf9>   DW_AT_decl_line   : 24
    <cfa>   DW_AT_decl_column : 19
    <cfb>   DW_AT_type        : <0xc90>
 <1><cff>: Abbrev Number: 1 (DW_TAG_typedef)
    <d00>   DW_AT_name        : (indirect string, offset: 0x52c84): int32_t
    <d04>   DW_AT_decl_file   : 4
    <d05>   DW_AT_decl_line   : 44
    <d06>   DW_AT_decl_column : 19
    <d07>   DW_AT_type        : <0xcb1>
 <1><d0b>: Abbrev Number: 1 (DW_TAG_typedef)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x6656d): uint32_t
    <d10>   DW_AT_decl_file   : 4
    <d11>   DW_AT_decl_line   : 48
    <d12>   DW_AT_decl_column : 20
    <d13>   DW_AT_type        : <0xcc4>
 <1><d17>: Abbrev Number: 1 (DW_TAG_typedef)
    <d18>   DW_AT_name        : (indirect string, offset: 0x981e): size_t
    <d1c>   DW_AT_decl_file   : 5
    <d1d>   DW_AT_decl_line   : 214
    <d1e>   DW_AT_decl_column : 23
    <d1f>   DW_AT_type        : <0xcec>
 <1><d23>: Abbrev Number: 3 (DW_TAG_base_type)
    <d24>   DW_AT_byte_size   : 8
    <d25>   DW_AT_encoding    : 4	(float)
    <d26>   DW_AT_name        : (indirect string, offset: 0x4f264): long double
 <1><d2a>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <d2b>   DW_AT_byte_size   : 4
 <1><d2c>: Abbrev Number: 1 (DW_TAG_typedef)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xd97aa): TraceUnsignedBaseType_t
    <d31>   DW_AT_decl_file   : 6
    <d32>   DW_AT_decl_line   : 30
    <d33>   DW_AT_decl_column : 32
    <d34>   DW_AT_type        : <0xd0b>
 <1><d38>: Abbrev Number: 1 (DW_TAG_typedef)
    <d39>   DW_AT_name        : (indirect string, offset: 0xdd2da): TraceBaseType_t
    <d3d>   DW_AT_decl_file   : 6
    <d3e>   DW_AT_decl_line   : 32
    <d3f>   DW_AT_decl_column : 23
    <d40>   DW_AT_type        : <0xcff>
 <1><d44>: Abbrev Number: 1 (DW_TAG_typedef)
    <d45>   DW_AT_name        : (indirect string, offset: 0xdd21a): TraceHandleBaseType_t
    <d49>   DW_AT_decl_file   : 6
    <d4a>   DW_AT_decl_line   : 35
    <d4b>   DW_AT_decl_column : 15
    <d4c>   DW_AT_type        : <0xd2a>
 <1><d50>: Abbrev Number: 1 (DW_TAG_typedef)
    <d51>   DW_AT_name        : (indirect string, offset: 0x61029): traceResult
    <d55>   DW_AT_decl_file   : 6
    <d56>   DW_AT_decl_line   : 40
    <d57>   DW_AT_decl_column : 33
    <d58>   DW_AT_type        : <0xd2c>
 <1><d5c>: Abbrev Number: 1 (DW_TAG_typedef)
    <d5d>   DW_AT_name        : (indirect string, offset: 0xdd171): TraceEntryHandle_t
    <d61>   DW_AT_decl_file   : 6
    <d62>   DW_AT_decl_line   : 46
    <d63>   DW_AT_decl_column : 31
    <d64>   DW_AT_type        : <0xd44>
 <1><d68>: Abbrev Number: 10 (DW_TAG_const_type)
    <d69>   DW_AT_type        : <0xd5c>
 <1><d6d>: Abbrev Number: 3 (DW_TAG_base_type)
    <d6e>   DW_AT_byte_size   : 1
    <d6f>   DW_AT_encoding    : 8	(unsigned char)
    <d70>   DW_AT_name        : (indirect string, offset: 0x47064): char
 <1><d74>: Abbrev Number: 10 (DW_TAG_const_type)
    <d75>   DW_AT_type        : <0xd6d>
 <1><d79>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d7a>   DW_AT_byte_size   : 4
    <d7a>   DW_AT_type        : <0xd74>
 <1><d7e>: Abbrev Number: 13 (DW_TAG_array_type)
    <d7f>   DW_AT_type        : <0xd2c>
    <d83>   DW_AT_sibling     : <0xd8e>
 <2><d87>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <d88>   DW_AT_type        : <0xcec>
    <d8c>   DW_AT_upper_bound : 2
 <2><d8d>: Abbrev Number: 0
 <1><d8e>: Abbrev Number: 1 (DW_TAG_typedef)
    <d8f>   DW_AT_name        : (indirect string, offset: 0xdd676): TraceEntryIndex_t
    <d93>   DW_AT_decl_file   : 7
    <d94>   DW_AT_decl_line   : 53
    <d95>   DW_AT_decl_column : 17
    <d96>   DW_AT_type        : <0xcf3>
 <1><d9a>: Abbrev Number: 18 (DW_TAG_structure_type)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xdd9b7): EntryIndexTable
    <d9f>   DW_AT_byte_size   : 64
    <da0>   DW_AT_decl_file   : 7
    <da0>   DW_AT_decl_line   : 59
    <da1>   DW_AT_decl_column : 16
    <da1>   DW_AT_sibling     : <0xdca>
 <2><da5>: Abbrev Number: 4 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0xdd636): axFreeIndexes
    <daa>   DW_AT_decl_file   : 7
    <daa>   DW_AT_decl_line   : 61
    <dab>   DW_AT_decl_column : 20
    <dac>   DW_AT_type        : <0xdca>
    <db0>   DW_AT_data_member_location: 0
 <2><db1>: Abbrev Number: 4 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0xdd90c): uiFreeIndexCount
    <db6>   DW_AT_decl_file   : 7
    <db6>   DW_AT_decl_line   : 62
    <db7>   DW_AT_decl_column : 11
    <db8>   DW_AT_type        : <0xd0b>
    <dbc>   DW_AT_data_member_location: 56
 <2><dbd>: Abbrev Number: 4 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0xdd9ae): reserved
    <dc2>   DW_AT_decl_file   : 7
    <dc2>   DW_AT_decl_line   : 63
    <dc3>   DW_AT_decl_column : 11
    <dc4>   DW_AT_type        : <0xd0b>
    <dc8>   DW_AT_data_member_location: 60
 <2><dc9>: Abbrev Number: 0
 <1><dca>: Abbrev Number: 13 (DW_TAG_array_type)
    <dcb>   DW_AT_type        : <0xd8e>
    <dcf>   DW_AT_sibling     : <0xdda>
 <2><dd3>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <dd4>   DW_AT_type        : <0xcec>
    <dd8>   DW_AT_upper_bound : 55
 <2><dd9>: Abbrev Number: 0
 <1><dda>: Abbrev Number: 1 (DW_TAG_typedef)
    <ddb>   DW_AT_name        : (indirect string, offset: 0xdd946): TraceEntryIndexTable_t
    <ddf>   DW_AT_decl_file   : 7
    <de0>   DW_AT_decl_line   : 64
    <de1>   DW_AT_decl_column : 3
    <de2>   DW_AT_type        : <0xd9a>
 <1><de6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <de7>   DW_AT_name        : (indirect string, offset: 0x7cf88): TraceEntry
    <deb>   DW_AT_byte_size   : 48
    <dec>   DW_AT_decl_file   : 7
    <dec>   DW_AT_decl_line   : 67
    <ded>   DW_AT_decl_column : 16
    <ded>   DW_AT_sibling     : <0xe22>
 <2><df1>: Abbrev Number: 4 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0xaca7f): pvAddress
    <df6>   DW_AT_decl_file   : 7
    <df6>   DW_AT_decl_line   : 69
    <df7>   DW_AT_decl_column : 8
    <df8>   DW_AT_type        : <0xd2a>
    <dfc>   DW_AT_data_member_location: 0
 <2><dfd>: Abbrev Number: 4 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xe114b): xStates
    <e02>   DW_AT_decl_file   : 7
    <e02>   DW_AT_decl_line   : 70
    <e03>   DW_AT_decl_column : 26
    <e04>   DW_AT_type        : <0xd7e>
    <e08>   DW_AT_data_member_location: 4
 <2><e09>: Abbrev Number: 4 (DW_TAG_member)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xbaa64): uiOptions
    <e0e>   DW_AT_decl_file   : 7
    <e0e>   DW_AT_decl_line   : 71
    <e0f>   DW_AT_decl_column : 11
    <e10>   DW_AT_type        : <0xd0b>
    <e14>   DW_AT_data_member_location: 16
 <2><e15>: Abbrev Number: 4 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x48baf): szSymbol
    <e1a>   DW_AT_decl_file   : 7
    <e1a>   DW_AT_decl_line   : 72
    <e1b>   DW_AT_decl_column : 7
    <e1c>   DW_AT_type        : <0xe22>
    <e20>   DW_AT_data_member_location: 20
 <2><e21>: Abbrev Number: 0
 <1><e22>: Abbrev Number: 13 (DW_TAG_array_type)
    <e23>   DW_AT_type        : <0xd6d>
    <e27>   DW_AT_sibling     : <0xe32>
 <2><e2b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <e2c>   DW_AT_type        : <0xcec>
    <e30>   DW_AT_upper_bound : 27
 <2><e31>: Abbrev Number: 0
 <1><e32>: Abbrev Number: 1 (DW_TAG_typedef)
    <e33>   DW_AT_name        : (indirect string, offset: 0xd1c77): TraceEntry_t
    <e37>   DW_AT_decl_file   : 7
    <e38>   DW_AT_decl_line   : 73
    <e39>   DW_AT_decl_column : 3
    <e3a>   DW_AT_type        : <0xde6>
 <1><e3e>: Abbrev Number: 25 (DW_TAG_structure_type)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x760b2): TraceEntryTable
    <e43>   DW_AT_byte_size   : 2700
    <e45>   DW_AT_decl_file   : 7
    <e46>   DW_AT_decl_line   : 75
    <e47>   DW_AT_decl_column : 16
    <e48>   DW_AT_sibling     : <0xe7d>
 <2><e4c>: Abbrev Number: 4 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x5431f): uxSlots
    <e51>   DW_AT_decl_file   : 7
    <e51>   DW_AT_decl_line   : 77
    <e52>   DW_AT_decl_column : 26
    <e53>   DW_AT_type        : <0xd2c>
    <e57>   DW_AT_data_member_location: 0
 <2><e58>: Abbrev Number: 4 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0xa191f): uxEntrySymbolLength
    <e5d>   DW_AT_decl_file   : 7
    <e5d>   DW_AT_decl_line   : 78
    <e5e>   DW_AT_decl_column : 26
    <e5f>   DW_AT_type        : <0xd2c>
    <e63>   DW_AT_data_member_location: 4
 <2><e64>: Abbrev Number: 4 (DW_TAG_member)
    <e65>   DW_AT_name        : (indirect string, offset: 0xc6231): uxEntryStateCount
    <e69>   DW_AT_decl_file   : 7
    <e69>   DW_AT_decl_line   : 79
    <e6a>   DW_AT_decl_column : 26
    <e6b>   DW_AT_type        : <0xd2c>
    <e6f>   DW_AT_data_member_location: 8
 <2><e70>: Abbrev Number: 4 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0x51592): axEntries
    <e75>   DW_AT_decl_file   : 7
    <e75>   DW_AT_decl_line   : 80
    <e76>   DW_AT_decl_column : 15
    <e77>   DW_AT_type        : <0xe7d>
    <e7b>   DW_AT_data_member_location: 12
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 13 (DW_TAG_array_type)
    <e7e>   DW_AT_type        : <0xe32>
    <e82>   DW_AT_sibling     : <0xe8d>
 <2><e86>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <e87>   DW_AT_type        : <0xcec>
    <e8b>   DW_AT_upper_bound : 55
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 1 (DW_TAG_typedef)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x41eb5): TraceEntryTable_t
    <e92>   DW_AT_decl_file   : 7
    <e93>   DW_AT_decl_line   : 81
    <e94>   DW_AT_decl_column : 3
    <e95>   DW_AT_type        : <0xe3e>
 <1><e99>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xdd35d): TraceDiagnosticsType
    <e9e>   DW_AT_encoding    : 7	(unsigned)
    <e9f>   DW_AT_byte_size   : 1
    <ea0>   DW_AT_type        : <0xc9c>
    <ea4>   DW_AT_decl_file   : 8
    <ea5>   DW_AT_decl_line   : 28
    <ea6>   DW_AT_decl_column : 14
    <ea7>   DW_AT_sibling     : <0xeca>
 <2><eab>: Abbrev Number: 11 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0xdd4f9): TRC_DIAGNOSTICS_ENTRY_SYMBOL_LONGEST_LENGTH
    <eb0>   DW_AT_const_value : 0
 <2><eb1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0xdd3c8): TRC_DIAGNOSTICS_ENTRY_SLOTS_NO_ROOM
    <eb6>   DW_AT_const_value : 1
 <2><eb7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <eb8>   DW_AT_name        : (indirect string, offset: 0xdd45b): TRC_DIAGNOSTICS_BLOB_MAX_BYTES_TRUNCATED
    <ebc>   DW_AT_const_value : 2
 <2><ebd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xdd4b0): TRC_DIAGNOSTICS_STACK_MONITOR_NO_SLOTS
    <ec2>   DW_AT_const_value : 3
 <2><ec3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xdd4d7): TRC_DIAGNOSTICS_ASSERTS_TRIGGERED
    <ec8>   DW_AT_const_value : 4
 <2><ec9>: Abbrev Number: 0
 <1><eca>: Abbrev Number: 1 (DW_TAG_typedef)
    <ecb>   DW_AT_name        : (indirect string, offset: 0xdd346): TraceDiagnosticsType_t
    <ecf>   DW_AT_decl_file   : 8
    <ed0>   DW_AT_decl_line   : 35
    <ed1>   DW_AT_decl_column : 3
    <ed2>   DW_AT_type        : <0xe99>
 <1><ed6>: Abbrev Number: 27 (DW_TAG_variable)
    <ed7>   DW_AT_name        : (indirect string, offset: 0xdd230): RecorderInitialized
    <edb>   DW_AT_decl_file   : 10
    <edc>   DW_AT_decl_line   : 1655
    <ede>   DW_AT_decl_column : 17
    <edf>   DW_AT_type        : <0xd0b>
    <ee3>   DW_AT_external    : 1
    <ee3>   DW_AT_declaration : 1
 <1><ee3>: Abbrev Number: 6 (DW_TAG_variable)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xdd614): pxEntryTable
    <ee8>   DW_AT_decl_file   : 1
    <ee8>   DW_AT_decl_line   : 34
    <ee9>   DW_AT_decl_column : 27
    <eea>   DW_AT_type        : <0xef4>
    <eee>   DW_AT_location    : 5 byte block: 3 18 2 0 20 	(DW_OP_addr: 20000218)
 <1><ef4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ef5>   DW_AT_byte_size   : 4
    <ef5>   DW_AT_type        : <0xe8d>
 <1><ef9>: Abbrev Number: 10 (DW_TAG_const_type)
    <efa>   DW_AT_type        : <0xef4>
 <1><efe>: Abbrev Number: 6 (DW_TAG_variable)
    <eff>   DW_AT_name        : (indirect string, offset: 0xdd8da): pxIndexTable
    <f03>   DW_AT_decl_file   : 1
    <f03>   DW_AT_decl_line   : 35
    <f04>   DW_AT_decl_column : 32
    <f05>   DW_AT_type        : <0xf0f>
    <f09>   DW_AT_location    : 5 byte block: 3 1c 2 0 20 	(DW_OP_addr: 2000021c)
 <1><f0f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f10>   DW_AT_byte_size   : 4
    <f10>   DW_AT_type        : <0xdda>
 <1><f14>: Abbrev Number: 10 (DW_TAG_const_type)
    <f15>   DW_AT_type        : <0xf0f>
 <1><f19>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f1a>   DW_AT_external    : 1
    <f1a>   DW_AT_name        : (indirect string, offset: 0xdd999): memcpy
    <f1e>   DW_AT_decl_file   : 9
    <f1f>   DW_AT_decl_line   : 31
    <f20>   DW_AT_decl_column : 9
    <f21>   DW_AT_prototyped  : 1
    <f21>   DW_AT_type        : <0xd2a>
    <f25>   DW_AT_declaration : 1
    <f25>   DW_AT_sibling     : <0xf39>
 <2><f29>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f2a>   DW_AT_type        : <0xd2a>
 <2><f2e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f2f>   DW_AT_type        : <0xf39>
 <2><f33>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f34>   DW_AT_type        : <0xd17>
 <2><f38>: Abbrev Number: 0
 <1><f39>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f3a>   DW_AT_byte_size   : 4
    <f3a>   DW_AT_type        : <0xf43>
 <1><f3e>: Abbrev Number: 10 (DW_TAG_const_type)
    <f3f>   DW_AT_type        : <0xf39>
 <1><f43>: Abbrev Number: 28 (DW_TAG_const_type)
 <1><f44>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f45>   DW_AT_external    : 1
    <f45>   DW_AT_name        : (indirect string, offset: 0xdd3ec): xTraceDiagnosticsSetIfHigher
    <f49>   DW_AT_decl_file   : 8
    <f4a>   DW_AT_decl_line   : 114
    <f4b>   DW_AT_decl_column : 13
    <f4c>   DW_AT_prototyped  : 1
    <f4c>   DW_AT_type        : <0xd50>
    <f50>   DW_AT_declaration : 1
    <f50>   DW_AT_sibling     : <0xf5f>
 <2><f54>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f55>   DW_AT_type        : <0xeca>
 <2><f59>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f5a>   DW_AT_type        : <0xd38>
 <2><f5e>: Abbrev Number: 0
 <1><f5f>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f60>   DW_AT_external    : 1
    <f60>   DW_AT_name        : (indirect string, offset: 0xdd41e): xTraceDiagnosticsIncrease
    <f64>   DW_AT_decl_file   : 8
    <f65>   DW_AT_decl_line   : 93
    <f66>   DW_AT_decl_column : 13
    <f67>   DW_AT_prototyped  : 1
    <f67>   DW_AT_type        : <0xd50>
    <f6b>   DW_AT_declaration : 1
    <f6b>   DW_AT_sibling     : <0xf75>
 <2><f6f>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f70>   DW_AT_type        : <0xeca>
 <2><f74>: Abbrev Number: 0
 <1><f75>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f76>   DW_AT_name        : (indirect string, offset: 0xdd602): prvEntryIndexTake
    <f7a>   DW_AT_decl_file   : 1
    <f7a>   DW_AT_decl_line   : 407
    <f7c>   DW_AT_decl_column : 20
    <f7c>   DW_AT_prototyped  : 1
    <f7c>   DW_AT_type        : <0xd50>
    <f80>   DW_AT_low_pc      : 0x8001614
    <f84>   DW_AT_high_pc     : 0x60
    <f88>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f8a>   DW_AT_call_all_calls: 1
    <f8a>   DW_AT_sibling     : <0xfaf>
 <2><f8e>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <f8f>   DW_AT_name        : (indirect string, offset: 0xdd77f): pxIndex
    <f93>   DW_AT_decl_file   : 1
    <f94>   DW_AT_decl_line   : 407
    <f96>   DW_AT_decl_column : 57
    <f97>   DW_AT_type        : <0xfaf>
    <f9b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f9e>: Abbrev Number: 30 (DW_TAG_variable)
    <f9f>   DW_AT_name        : (indirect string, offset: 0xdd780): xIndex
    <fa3>   DW_AT_decl_file   : 1
    <fa4>   DW_AT_decl_line   : 410
    <fa6>   DW_AT_decl_column : 20
    <fa7>   DW_AT_type        : <0xd8e>
    <fab>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><fae>: Abbrev Number: 0
 <1><faf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fb0>   DW_AT_byte_size   : 4
    <fb0>   DW_AT_type        : <0xd8e>
 <1><fb4>: Abbrev Number: 19 (DW_TAG_subprogram)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xdd92e): prvEntryIndexInitialize
    <fb9>   DW_AT_decl_file   : 1
    <fb9>   DW_AT_decl_line   : 393
    <fbb>   DW_AT_decl_column : 20
    <fbb>   DW_AT_prototyped  : 1
    <fbb>   DW_AT_type        : <0xd50>
    <fbf>   DW_AT_low_pc      : 0x80015d0
    <fc3>   DW_AT_high_pc     : 0x44
    <fc7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fc9>   DW_AT_call_all_calls: 1
    <fc9>   DW_AT_sibling     : <0xfdc>
 <2><fcd>: Abbrev Number: 31 (DW_TAG_variable)
    <fce>   DW_AT_name        : i
    <fd0>   DW_AT_decl_file   : 1
    <fd1>   DW_AT_decl_line   : 395
    <fd3>   DW_AT_decl_column : 11
    <fd4>   DW_AT_type        : <0xd0b>
    <fd8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fdb>: Abbrev Number: 0
 <1><fdc>: Abbrev Number: 12 (DW_TAG_subprogram)
    <fdd>   DW_AT_external    : 1
    <fdd>   DW_AT_name        : (indirect string, offset: 0xdd769): xTraceEntryGetAtIndex
    <fe1>   DW_AT_decl_file   : 1
    <fe1>   DW_AT_decl_line   : 243
    <fe2>   DW_AT_decl_column : 13
    <fe2>   DW_AT_prototyped  : 1
    <fe2>   DW_AT_type        : <0xd50>
    <fe6>   DW_AT_low_pc      : 0
    <fea>   DW_AT_high_pc     : 0x34
    <fee>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ff0>   DW_AT_call_all_calls: 1
    <ff0>   DW_AT_sibling     : <0x1011>
 <2><ff4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ff5>   DW_AT_name        : (indirect string, offset: 0xdd5d9): index
    <ff9>   DW_AT_decl_file   : 1
    <ff9>   DW_AT_decl_line   : 243
    <ffa>   DW_AT_decl_column : 44
    <ffb>   DW_AT_type        : <0xd0b>
    <fff>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1002>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <1003>   DW_AT_name        : (indirect string, offset: 0xdd694): pxEntryHandle
    <1007>   DW_AT_decl_file   : 1
    <1007>   DW_AT_decl_line   : 243
    <1008>   DW_AT_decl_column : 71
    <1009>   DW_AT_type        : <0x1011>
    <100d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><1010>: Abbrev Number: 0
 <1><1011>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1012>   DW_AT_byte_size   : 4
    <1012>   DW_AT_type        : <0xd5c>
 <1><1016>: Abbrev Number: 12 (DW_TAG_subprogram)
    <1017>   DW_AT_external    : 1
    <1017>   DW_AT_name        : (indirect string, offset: 0xdd588): xTraceEntryGetCount
    <101b>   DW_AT_decl_file   : 1
    <101b>   DW_AT_decl_line   : 230
    <101c>   DW_AT_decl_column : 13
    <101c>   DW_AT_prototyped  : 1
    <101c>   DW_AT_type        : <0xd50>
    <1020>   DW_AT_low_pc      : 0
    <1024>   DW_AT_high_pc     : 0x28
    <1028>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <102a>   DW_AT_call_all_calls: 1
    <102a>   DW_AT_sibling     : <0x103d>
 <2><102e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <102f>   DW_AT_name        : (indirect string, offset: 0xdd91d): puiCount
    <1033>   DW_AT_decl_file   : 1
    <1033>   DW_AT_decl_line   : 230
    <1034>   DW_AT_decl_column : 43
    <1035>   DW_AT_type        : <0x103d>
    <1039>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><103c>: Abbrev Number: 0
 <1><103d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <103e>   DW_AT_byte_size   : 4
    <103e>   DW_AT_type        : <0xd0b>
 <1><1042>: Abbrev Number: 17 (DW_TAG_subprogram)
    <1043>   DW_AT_external    : 1
    <1043>   DW_AT_name        : (indirect string, offset: 0xdd5b1): xTraceEntrySetSymbol
    <1047>   DW_AT_decl_file   : 1
    <1047>   DW_AT_decl_line   : 195
    <1048>   DW_AT_decl_column : 13
    <1048>   DW_AT_prototyped  : 1
    <1048>   DW_AT_type        : <0xd50>
    <104c>   DW_AT_low_pc      : 0x800157c
    <1050>   DW_AT_high_pc     : 0x54
    <1054>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1056>   DW_AT_call_all_tail_calls: 1
